[
  {
    "dungeon" : "Arx Corinium",
    "description" : "Arx Corinium is a dungeon filled with snakes and Lamia.",
    "sets" : ["Sellistrix", "Lamia's Song", "Undaunted Infiltrator", "Medusa"],
    "bosses" : [
      {"name" :  "Fanged Menace",
        "mechanics": [
          "Frontal cone attack that causes knockback and damages severely any player caught in it.",
          "AOE Poison attack that absorbs health from those hit by it to the Boss. The red circle made underneat him while he curls up can damage heavily and also heal the boss.",
          "Other ads surrounding the boss",
          "Heavy melee attacks"
        ],
        "strategy" : [
          "Deal with the ads first.",
          "The tank should block the heavy Melee attack and keep the boss focused away from the group.",
          "Avoid the large AOE red circle as it can instantly wipeout any player within its reach."
        ]
      },
      {"name" :  "Ganakton the Tempest",
        "mechanics": [
          "Lightning Wave that is emitted towards a random player. The wave can cause high amounts of Shock damage and stun anyone close-by.",
          "Immediately after the wave, the Boss will send a lightning bolt at the same player causing Shock damage and stunning them again.",
          "Ganakton can also electrify all players with a shock pulse every now and then. This does medium levels of damage but is unavoidable.",
          "Frontal cone lightning breath"
        ],
        "strategy" : [
          "Due to all the shock waves that can stun players, it is best to spread out across the room to give yourself plenty of room to avoid the Waves and ensure you don't hurt another player in the process.",
          "If you get hit by the Wave, you can escape the Stun element by using an Interrupt or break free ability using your stamina.",
          "The shock pulses are difficult to avoid so it is best to just heal through them."
        ]
      },
     {"name" :  "Sliklenia the Songstress",
        "mechanics": [
          "A pet ad that you should not kill until the boss is dead.",
          "Sound pulse that does high amounts of damage when the boss sings.",
          "Heavy melee attack"
        ],
        "strategy" : [
          "DON'T kill the pet before killing the boss. The ad is actually beneficial to the players in order to minimize the damage taken from the singing. When the boss sings, the pet will create a sonic shield in a random location in the room and retreat to it. You should follow the pet into that shield to avoid taking the crazy amounts of damage the Sound pulses can deal.(She must be a horrible singer because you can die from her singing!)",
          "Kill the pet after the Songstress dies.",
          "Tank should block the heavy melee attacks."
        ]
      },
    {"name" :  "Matron Ixniaa",
      "mechanics": [
        "Randomly places 2 circles (1 big and 1 small) underneath a player.",
        "Bunch of ads"
       ],
       "strategy" : [
         "Deal with the ads first as they can be overwhelming if not taken care of from the start.",
         "The inner circle (smaller one) must be avoided as it can deal large amounts of damage and even kill you if you're not at full health. The outer circle (bigger one) does damage from which you can recover.",
         "Healer should try to keep the player targeted with the 2 circles at full health as a precaution"
       ]
      },
    {"name" :  "Ancient Lurcher",
      "mechanics": [
        "Randomly targets a player with a green beam that does severe poison damage.",
        "Red circles underneath the Boss that damage those caught inside.",
        "Enrage and Lightning charge that strengthens his AOE ability once his health is below 50%",
        "Bunch of ads"
      ],
      "strategy" : [
        "Attack the ads first before you focus on the boss.",
        "Avoid the green beams as they can be fatal."
      ]
     },
   {"name" :  "Sellistrix the Lamia Queen",
     "mechanics": [
       "Charges at players at random doing small amounts of damage.",
       "Lightning strikes channelled at certain islands in the room marked by red circles. During this attack, if the Queen is in the water, the water becomes electrified and any players standing in the water will be electrocuted.",
       "Frontal cone scream that does heavy damage."
     ],
     "strategy" : [
       "Tank should focus the Queen facing away from the rest of the group to ensure your group is not hit by the nasty frontal scream.",
       "Avoid being in the water as you risk being electrocuted if the lightning strike takes place while the Queen is standing in water.",
       "The islands are a safe bet but they get targeted by the lightning AOE from time to time.",
       "It may be better to just stay on the island and endure the AOE hit rather than stepping in the electrified water if you have a dedicated healer on your group.",
       "On land she gets a damage shield, the tank should get her in the water to do spell criticals and normal damage. When she electrocutes, get the tank out of the water.",
       "The screams are random and cannot be taunted.",
       "It appears that only the range taunts work, the piercing strike has trouble taunting her",
       "After scream, boss need to be taunt 5 time or boss attack random person"
     ]
    }    
      
    ],
    "link" : "https://elderscrollsonline.wiki.fextralife.com/Arx+Corinium"
  }
]
