[
  {
    "dungeon": "Arx Corinium",
    "description": "Arx Corinium is a dungeon filled with snakes and Lamia.",
    "image": "https://imgur.com/CwP9AxB.png",
    "sets": [
      "Sellistrix",
      "Lamia's Song",
      "Undaunted Infiltrator",
      "Medusa"
    ],
    "bosses": [
      {
        "name": "Fanged Menace",
        "mechanics": [
          "Frontal cone attack that causes knockback and damages severely any player caught in it.",
          "AOE Poison attack that absorbs health from those hit by it to the Boss. The red circle made underneat him while he curls up can damage heavily and also heal the boss.",
          "Other ads surrounding the boss",
          "Heavy melee attacks"
        ],
        "strategy": [
          "Deal with the ads first.",
          "The tank should block the heavy Melee attack and keep the boss focused away from the group.",
          "Avoid the large AOE red circle as it can instantly wipeout any player within its reach."
        ]
      },
      {
        "name": "Ganakton the Tempest",
        "mechanics": [
          "Lightning Wave that is emitted towards a random player. The wave can cause high amounts of Shock damage and stun anyone close-by.",
          "Immediately after the wave, the Boss will send a lightning bolt at the same player causing Shock damage and stunning them again.",
          "Ganakton can also electrify all players with a shock pulse every now and then. This does medium levels of damage but is unavoidable.",
          "Frontal cone lightning breath"
        ],
        "strategy": [
          "Due to all the shock waves that can stun players, it is best to spread out across the room to give yourself plenty of room to avoid the Waves and ensure you don't hurt another player in the process.",
          "If you get hit by the Wave, you can escape the Stun element by using an Interrupt or break free ability using your stamina.",
          "The shock pulses are difficult to avoid so it is best to just heal through them."
        ]
      },
      {
        "name": "Sliklenia the Songstress",
        "mechanics": [
          "A pet ad that you should not kill until the boss is dead.",
          "Sound pulse that does high amounts of damage when the boss sings.",
          "Heavy melee attack"
        ],
        "strategy": [
          "DON'T kill the pet before killing the boss. The ad is actually beneficial to the players in order to minimize the damage taken from the singing. When the boss sings, the pet will create a sonic shield in a random location in the room and retreat to it. You should follow the pet into that shield to avoid taking the crazy amounts of damage the Sound pulses can deal.(She must be a horrible singer because you can die from her singing!)",
          "Kill the pet after the Songstress dies.",
          "Tank should block the heavy melee attacks."
        ]
      },
      {
        "name": "Matron Ixniaa",
        "mechanics": [
          "Randomly places 2 circles (1 big and 1 small) underneath a player.",
          "Bunch of ads"
        ],
        "strategy": [
          "Deal with the ads first as they can be overwhelming if not taken care of from the start.",
          "The inner circle (smaller one) must be avoided as it can deal large amounts of damage and even kill you if you're not at full health. The outer circle (bigger one) does damage from which you can recover.",
          "Healer should try to keep the player targeted with the 2 circles at full health as a precaution"
        ]
      },
      {
        "name": "Ancient Lurcher",
        "mechanics": [
          "Randomly targets a player with a green beam that does severe poison damage.",
          "Red circles underneath the Boss that damage those caught inside.",
          "Enrage and Lightning charge that strengthens his AOE ability once his health is below 50%",
          "Bunch of ads"
        ],
        "strategy": [
          "Attack the ads first before you focus on the boss.",
          "Avoid the green beams as they can be fatal."
        ]
      },
      {
        "name": "Sellistrix the Lamia Queen",
        "mechanics": [
          "Charges at players at random doing small amounts of damage.",
          "Lightning strikes channelled at certain islands in the room marked by red circles. During this attack, if the Queen is in the water, the water becomes electrified and any players standing in the water will be electrocuted.",
          "Frontal cone scream that does heavy damage."
        ],
        "strategy": [
          "Tank should focus the Queen facing away from the rest of the group to ensure your group is not hit by the nasty frontal scream.",
          "Avoid being in the water as you risk being electrocuted if the lightning strike takes place while the Queen is standing in water.",
          "The islands are a safe bet but they get targeted by the lightning AOE from time to time.",
          "It may be better to just stay on the island and endure the AOE hit rather than stepping in the electrified water if you have a dedicated healer on your group.",
          "On land she gets a damage shield, the tank should get her in the water to do spell criticals and normal damage. When she electrocutes, get the tank out of the water.",
          "The screams are random and cannot be taunted.",
          "It appears that only the range taunts work, the piercing strike has trouble taunting her",
          "After scream, boss need to be taunt 5 time or boss attack random person"
        ]
      }
    ],
    "link": "https://elderscrollsonline.wiki.fextralife.com/Arx+Corinium"
  },
  {
    "dungeon": "Blackheart Haven",
    "description": "Blackheart Haven is pirate-infested dungeon that will keep the Tanks and Healers busy with the large amounts of damage and heavy attacks going about.",
    "image": "https://imgur.com/n4XWMWT.png",
    "sets": [
      "Pirate Skeleton",
      "Undaunted Unweaver",
      "Bone Pirate's Tatters",
      "Knight-Errant's Mail"
    ],
    "bosses": [
      {
        "name": "Iron-Heel",
        "mechanics": [
          "Heavy melee attacks that can knock you down if not blocked.",
          "AOE whirlwinds around himself that are easy to escape.",
          "Bunch of ads."
        ],
        "strategy": [
          "Kill the ads quickly. After that it is a straightforward fight."
        ]
      },
      {
        "name": "Atarus",
        "mechanics": [
          "Cone AOE that spews poisonous acid at the players.",
          "Stomp AOE knockdown (360 degrees).",
          "Charges towards the tank occasionally (indicated by red path).",
          "Heals himself back to 50% once after his health drops below 30%."
        ],
        "strategy": [
          "Avoid the AOE attacks by simply walking away.",
          "Move out of the path of the charge.",
          "Continue to attack after he regains his health back to 50%."
        ]
      },
      {
        "name": "First Mate Wavecutter",
        "mechanics": [
          "Harpies (ads) that deal ranged attacks which can damage you severely.",
          "Shadow Volley that deals severe magic damage to all players (up to 50% loss of health).",
          "Heavy attack that can knock you down if not blocked.",
          "AOE whirlwinds (360 degrees) around himself that are easy to escape."
        ],
        "strategy": [
          "There are 2 ways to handle this boss. The First is to ignore the ads and just go all out Rambo on the boss. The Second is to kill the ads one by one (however there is high risk of wiping out in the process this way)."
        ]
      },
      {
        "name": "Roost Mother",
        "mechanics": [
          "Fiery tornado targeting the Tank that can deal heavy damage.",
          "Rain of Fireballs that fall on expanding red circles on the ground. (Heavy damage).",
          "Frontal Cone AOE fire-breathing that can be difficult to avoid if you are standing in front of the Roost Mother.",
          "Random teleportation around the room."
        ],
        "strategy": [
          "The Fiery Tornado attack can be expected when the Roost Mother becomes surrounded by bats. The tank should step away from the boss when this happens to avoid being hit by this attack.",
          "Stay away from the red circles on the ground as fireballs will drop from the sky into those areas. You do not want to be hit by one of them.",
          "Keep moving around the room to deal damage to the boss (preferably from behind her so as to avoid the Frontal Cone AOE)."
        ]
      },
      {
        "name": "Hollow Heart",
        "mechanics": [
          "Ice projectiles that are fired in front of her and leave behind icy patches that slowly deal damage over time."
        ],
        "strategy": [
          "The boss is not difficult to handle. Tank should keep the boss focused away from the rest of the group to ensure the others are not hit by the Ice Projectiles."
        ]
      },
      {
        "name": "Captain Blackheart",
        "mechanics": [
          "6 Skeleton ads which includes archers.",
          "360 degree slash attack that is very quick but does little damage.",
          "boss charging to random group member and start converting him to skeleton (cannot be interrupted). Skeleton debuff lasts for 20-30 seconds."
        ],
        "strategy": [
          "Kill all the ads, prioritise the archers to avoid being overwhelmed."
        ]
      }
    ],
    "link": "https://elderscrollsonline.wiki.fextralife.com/Blackheart+Haven"
  },
  {
    "dungeon": "Blessed Crucible",
    "description": "Blessed Crucible is a dungeon that has a nordic feel to it.",
    "image": "https://imgur.com/HCnunA7.png",
    "sets": [
      "Troll King",
      "Sword Dancer",
      "Nikulas' Heavy Armor",
      "Noble Duelist's Silks"
    ],
    "bosses": [
      {
        "name": "Grunt the Clever",
        "mechanics": [
          "AOE Fear shout that periodically fears everyone.",
          "Massive frontal AOE melee attack."
        ],
        "strategy": [
          "Break free of the Fear using your Stamina.",
          "Avoid the frontal AOE by running away or rolling away if you must."
        ]
      },
      {
        "name": "The Pack",
        "mechanics": [
          "Consists of a number of bosses ( Fire mage, Dual Wielding Rogue, Heavy Armor Orc, Caster)",
          "Snagg Gro-Mashul (Armored Orc) does whirlwind AOE attacks with his two handed weapon.",
          "Nusana (Fire mage) casts beam of fire in front damaging everyone in its path.",
          "Dynus Aralas (Healer) who casts fire and ice spells",
          "Kayd at-Sal (Rogue) who should be tanked.",
          "Each boss turns into a werewolf at 30% health."
        ],
        "strategy": [
          "Go for the healer first as he can make the fight a pain.",
          "Then prioritise the Rogue as he can also be annoying with his quick attacks.",
          "After a certain time, health potions may appear in the middle of the room which can be used."
        ]
      },
      {
        "name": "Teranya the Faceless",
        "mechanics": [
          "360 degree AOE attack that does mild damage and can be easily avoided.",
          "Heavy melee attack that does heavy damage and knockdown if not blocked by the tank.",
          "Frigid Banekins that spawns at the Boss' original location and charge at players to explode and cause large AOE damage."
        ],
        "strategy": [
          "The boss itself is very simple. However the 2 Enraged Durzog ads that come with The Faceless can be very damaging and should be killed on priority."
        ]
      },
      {
        "name": "The Stinger & The Troll King",
        "mechanics": [
          "The Stinger periodically targets a player and then creates a poisonous cloud underneath them. This attack can be fatal if you don't move out of the cloud immediately.",
          "The Troll King can deal loads of damage with all his attacks. He will periodically jump towards a random target dealing damage to the entire group.",
          "The Troll also uses AOE attacks that can also cause heavy damage",
          "Frontal Tremor is an attack that the Troll uses to create waves around him that should be avoided."
        ],
        "strategy": [
          "Tank should keep the boss facing away from the group."
        ]
      },
      {
        "name": "Captain Thoran",
        "mechanics": [
          "Fire Runes that are cast on the ground causing moderate damage to those who step on them.",
          "Purple clouds that randomly appear around the room causing damage to anyone in them.",
          "At low health, a Lava Atronach is spawned, giving a big shield to the Captain. The shield disappears after killing the Atronach."
        ],
        "strategy": [
          "Kill the ads around before focusing on the boss.",
          "Keep moving around to avoid being caught in the purple clouds."
        ]
      },
      {
        "name": "Lava Queen",
        "mechanics": [
          "Periodically summons Lava Atronachs that shield the boss through their beams.",
          "Random lava eruptions marked by red circles.",
          "Large lava eruptions underneath the Queen when she swings her sword at the ground that can do damage in multiple directions.",
          "Fire attack on distant targets.",
          "Heavy melee attack."
        ],
        "strategy": [
          "Take it easy. Slow and steady wins the race. This fight is all about fighting the Lava Atronachs, avoiding the pools of lava being thrown at you and pulling back into the fight after the eruption stops.",
          "Heavy melle attacks should be blocked by the tank."
        ]
      }
    ],
    "link": "https://elderscrollsonline.wiki.fextralife.com/Blessed+Crucible"
  },
  {
    "dungeon": "Bloodroot Forge",
    "description": " This is a challenging dungeon in Veteran modes. Players should form a well-geared party at endgame level.",
    "image": "https://imgur.com/sxw9Vtn.png",
    "sets": [
      "Flame Blossom",
      "Blooddrinker",
      "Hagraven's Garden",
      "Earthgore"
    ],
    "bosses": [
      {
        "name": "Mathgamain",
        "mechanics": [
          "The boss will spawn little mini adds, try and taunt these best you can tank. If it means you turning around the boss towards the group, it’s not worth it. Try to range taunt and CC (crowd control) them. Chain pull works great as well.",
          "Stranglers will spawn randomly, they will put up AOEs everywhere which hurt a LOT! As soon as a Strangler appears, immediately focus on it! You can tell that a Strangler is present by the AOEs it puts out. As soon as you see an AOE, look for a Strangler and get it! Tank – No need to taunt these.",
          "The boss will get up on its hind legs and slam into the ground. Any group member hit by this will go down. Tank – you have to block or evade this, it’s very powerful."
        ],
        "strategy": [
          "The tank needs to make sure to pick up the adds as best as possible.",
          "Keep the boss faced away from the group – the cone AOE will one-shot squishy players.",
          "Kill stranglers first! Always kill stranglers first!",
          "Make sure to deal with the adds, don’t ignore them. CC if you can and get them before focusing on the boss."
        ]
      },
      {
        "name": "Caillaoife",
        "mechanics": [
          "The boss will put up a forest around her that will shield and deflect any attacks targeted at her. Don’t attack when she is in this state! You will always have adds when she is in forest mode so deal with those while she is in there.",
          "Make sure to keep an eye out for Stranglers ALL the time! As soon as you see one, deal with it immediately! Even if you have adds, Stranglers first! Always!",
          "When she is in forest mode, the tank will lose aggro, there is no way to taunt her. So she will start dispatching these ice balls at random players. Make sure to stay on your guard during the forest phase when dealing with adds. The ice balls will come out of nowhere and one-shot you!",
          "Adds will show up whenever the boss enters forest shield mode. The tank should CC, taunt these and clump them up. Damage dealers – give it your best with AOEs, focus should be on the bigger add."
        ],
        "strategy": [
          "Stranglers first! Always deal with stranglers as soon as you spot them no matter what else is going on.",
          "Watch out for the boss’ iceball attacks that trace the ground – they will one-shot you.",
          "The boss will surround herself with a forest and adds will spawn – deal with the adds first!",
          "Don’t attack the boss when she has the forest around her, it will reflect your attack back onto you!",
          "Face the boss away from the group! She does cone attacks and nasty ice balls."
        ]
      },
      {
        "name": "Stoneheart",
        "mechanics": [
          "The boss will animate Stone Atronachs, you can see this by watching the boss, he will wave his hand and emit red magic. The red magic will flow to the Atronach about to be animated.",
          "The boss will keep putting out fire AOEs at his target’s feet. Tank, you can back away when this happens so that the AOEs don’t end up near the boss. Range taunt him to keep aggro.",
          "The boss will root all players and immediately start shooting out little fireballs in all directions that will trace the ground. These hurt quite a lot so back off and do your best at avoiding these!",
          "When the boss reaches 20% he will animate ALL Stone Atronachs. This is a DPS (damage per second) race, it’s time to ignore all the Stone Atronachs and max out your damage on the boss."
        ],
        "strategy": [
          "The boss will animate Stone Atronachs – these are the number one priority for damage dealers.",
          "At 20% the boss will animate all Stone Atronachs, this is an execute phase, ignore all Atronachs and burn the boss down with Ultimates.",
          "The boss’ fire AOEs are bad for squishy players, stay away from them as much as you can!"
        ]
      },
      {
        "name": "Galchobhar",
        "mechanics": [
          "The boss will slam his mace into the ground and open up a hole in the ground. This hole will emit fireballs that will fly onto all players. This deals a ton of damage and will wipe the group!",
          "The boss will slam into the ground and kill anyone standing on the island. The only way to avoid this is to jump onto one of the small rocks that surround the island.",
          "After he is done, on veteran difficulty there will be a firewall for a few seconds around the island, make sure you wait for this to go away before jumping back on the main island! It will take you out instantly.",
          "There will be shalks spawning throughout the fight. Focus them down as soon as they appear, and jump onto a rock if you get targeted by their homing fireball. Wait for the fireball to merge with the lava, then you are safe to jump back onto the main island."
        ],
        "strategy": [
          "The tank has to “plug” the lava geyser to avoid a group wipe, more on this below.",
          "During the big AOE that covers the entire island, jump onto a rock, no sharing!",
          "Face the boss away from the group, he shoots out fireballs in the direction he is facing."
        ]
      },
      {
        "name": "Earthgore Amalgam",
        "mechanics": [
          "At each end of the room, you will find two altars. These will need to be used through this fight and one person should be appointed to each altar. Generally, the damage dealers will be responsible for these.",
          "The Blood Altar will create a rain of blood wherever you aim at the point of synergizing. This can be used to remove the flowing lava that the boss sends out.",
          "The Fire Altar will hurl a fireball at your target upon synergizing with the altar. This will stun the boss. Use the fire altar when the boss is slamming the ground and rocks are falling from the sky.",
          "The boss will spawn a smaller version of itself. This will happen twice so you will have a total of 3 bosses to deal with. The boss will split at 70% – 40%  health percentages.",
          "To activate hard mode in Bloodroot Forge you need to read the Scroll of Glorious Battle located by the chest that appears after beating the Bullblood Trio. The main difference is that now you are not allowed to use the Altars."
        ],
        "strategy": [
          "**Tank:** Once you have 3 copies of the boss hammering you, you HAVE to pay attention to incoming heavy attacks! If you miss one block, you are down! Do NOT lose aggro on any of them at any point!  Maintaining resources in this last stage will be very difficult. Make sure you have potions ready for the third copy of the boss, ultimate, everything you’ve got!",
          "**Healer:** the tank will need every resource help possible, feed shards and bubbles!",
          "**Damage:** The boss will split itself into 3 versions of himself, you should always focus on the smallest copy!",
          "Manage the lava with the Blood Altar.",
          "Manage the falling rocks with the Fire Altar."
        ]
      }
    ],
    "link": "https://esoplanet.com/bloodroot-forge-dungeon-guide/"
  },
  {
    "dungeon": "City of Ash I",
    "description": "City of Ash is another 4-man dungeon in Elder Scrolls Online. It is found in Greenshade.",
    "image": "https://imgur.com/pV5HmZ8.png",
    "sets": [
      "Infernal Guardian",
      "Burning Spellweave",
      "Sunderflame",
      "Embershield"
    ],
    "bosses": [
      {
        "name": "Infernal Guardian",
        "mechanics": [
          "**Double Slam** - This is a pretty simple melee attack that should only hit the person with agro and can be blocked, it shouldn’t cause much of a problem.",
          "**Thorny Backhand** – This is a backhand animation and adds a bleed to the target so this should hopefully ONLY be hitting the tank meaning others don’t receive this damage.",
          "**Fiery Explosion** – The boss will shake violently throwing fireballs all around landing on the ground making aoe splash effects, you need to avoid these as dps/healer as much as possible. one or two hits can kill anything that is not a tank so watch your feet. Also during this phase he does close aoe fire damage from his location so stand back a bit.",
          "**Tunneling Roots** – When he stomps the ground he will make roots stream across the floor and whoever is caught in this will be immobilized on the spot (rooted) simple avoid this by moving left or right when you see it coming, OR dodge roll out of it if you get caught. it does a decent amount of physical damage so be careful not to get caught out if you are not the tank."
        ],
        "strategy": [
          "The tank should basically hold it still, as central to the room as possible and facing away from the group. He can however still hurt the group with various affects which if not paid attention to can one shot a squishy and/or wipe a group. So watch your feet!"
        ]
      },
      {
        "name": "Golor The Banekin Handler",
        "mechanics": [
          "This boss is extremely easy to kill however has some high damage if not controlled. Make sure your tank holds him STILL, do NOT run around the room and keep the banekins controlled if your group doesn’t have much damage."
        ],
        "strategy": [
          "**Crushing Blow** – Apart from his basic light attacks, the boss occasionally he will fire off a heavy attack, if you do not block this you will be knocked down and if the baneklins are still alive you can get overwhelmed with damage so make sure you BLOCK this.",
          "**Cleave** – he will spin her sword around her head, anyone caught in it will take physical damage over time. This is very obvious and easy to see, simply stay out of it and you will be fine.",
          "**Summon Banekin/daedra** – Throughout the fight he will summon 3 banekins (he starts with 3 also when you initiate the fight). Get your tank to pull them together and hold them in place while the dps do aoe damage to gradually kill them."
        ]
      },
      {
        "name": "Warden of the Shrine",
        "mechanics": [
          "**Heavy Attack** – The boss occasionally will fire off a nasty dual wield heavy attack with a MASSIVE knock back. You as the tank MUST block this or the fight is going to get messy fast! If a dps or healer has it they MUST also block it or they will most likely die, but above all your tank needs to be sure that this attack is ON the tank and not the squishies.",
          "**Blazing Fire** – The boss will spin and put a ring of small fire AoEs around him on the ground. Sometimes it will be clustered up, in which case stay away from it. Other times it can have a gap in the middle which you can stand in and take no damage. Keep an eye on which one it is and position yourself accordingly. Do NOT stand in the fire.",
          "**Teleport strike** – IF someone decides to run away from the boss, he WILL punish you. Stay close don’t panic and pay attention to his mechanics. IF you are the furthest away, he will strike you in the back. If you see this coming, you must block."
        ],
        "strategy": [
          "You are in a confined space on top of a cliff of sorts and one false move will wipe your group. **Tank** should try to keep him on his starting platform as much as possible and turn him AWAY from the group. Do not run around the place you do not have room."
        ]
      },
      {
        "name": "Dark Ember",
        "mechanics": [
          "**Lava Geyser** – This is an extremely easy to spot mechanic. Small spreading AoEs on the ground which erupt like a geyser of lava! The tank can with stand this if blocking but this is primarily cast on people that do NOT have agro. This is a very simple mechanic to avoid and all you need to do is simply, step out of it, wait for it to blow up, and then get back in position again.",
          "**Combustion** – When she dies she emits a Small AoE around her body and then it will explode. This will one shot a dps or healer."
        ],
        "strategy": [
          "She spawns with a few adds once the gate is clear and the tank should grab these right away, stack them on top of her and turn her away from the group. Her basic fireball attacks can be blocked and should only hit whoever has agro."
        ]
      },
      {
        "name": "Rothariel Flameheart",
        "mechanics": [
          "**Heavy attack** – She has a heavy attack that will knock you flying and do a nasty amount of damage especially if she follows up with a light attack afterwards. This will ONLY hit the person who has agro.",
          "**Berserker Frenzy** – She will spin her sword around her head, anyone caught in it will take physical damage over time. This is very obvious and easy to see, simply stay out of it and you will be fine.",
          "**Burning Field** – She will summon pools of fire on the ground which you must stay out of, these are VERY easy to see as they are big burst of fire on the ground. The damage isn’t too high but you don’t want to be in there for long.",
          "**Summon Clones** – Straight after the above mechanic she will spawn 3 clones of her self. They take MASSIVE damage in comparison to her so this is how you spot which one is which. They deal the same damage as the boss so should be killed fast."
        ],
        "strategy": [
          "This boss is fairly fast due to her low health but things can go horribly wrong if not controlled especially during her clone phase. Your tank should position her in the center and the dps should focus her down while preparing for each phase. The area you fight in is small and if you run down the stairs she will reset."
        ]
      },
      {
        "name": "Razor Master Erthas",
        "mechanics": [
          "**Fire burst** – Occasionally the boss will fire a projectile in the air and when it lands it will burst causing a 4 way cross affect of fire trailing along the floor. This won’t one shot you but this will do a LOT of damage so avoid it as much as possible.",
          "**Minions** – Whenever he says “rise minion” he will summon a flame atronach. These deal nasty flame attacks from range and explode when they die. Your tank should range taunt these to keep the damage off the group while the dps try to dispatch them quickly. Not killing them will result in having way too many of them towards the end of the fight.",
          "**Teleport** – Throughout the fight Razor will teleport to a random location. You can simply run to where he is and continue as your were while he repeats his rotation. THIS is your opportunity to throw down ultimates. save ultimates until he moves and drop them on him when he gets there. The reason for this is if you throw them down mid rotation he COULD teleport out of it and you loose overall dps.",
          "**Flame Shot** – Your group should be standing in somewhat of a formation. This is because periodically he will aim at a chosen member of the group and fire a heavy attack type shot at them. The ability can be blocked and/or dodged BUT if it physically hits you the dot will still stay with you. The fire dot is of a LONG duration. To clear this effect jump in the water.",
          "**Enrage** – The final phase under 25% he instead of spawning 1 atronach, will in fact spawn 3! Get your tank on point with the taunts and kill all of the atronachs before focusing the boss."
        ],
        "strategy": [
          "This boss is a ranged attacker but there is Lots of fire and there are LOTS of additional minions, so your tank will need a close ranged and long ranged taunt for this. Hold the boss as still as possible."
        ]
      }
    ],
    "link": "https://xynodegaming.com/cityofash1/"
  },
  {
    "dungeon": "City of Ash II",
    "description": "Veteran City of Ash presents some very challenging but fun boss fights for Veterans. The City of Ash is engulfed in flames, loads of them!",
    "image": "https://imgur.com/oN9jHpw.png",
    "sets": [
      "Valkyn Skoria",
      "Burning Spellweave",
      "Sunderflame",
      "Embershield"
    ],
    "bosses": [
      {
        "name": "Xivilai Rukhan",
        "mechanics": [
          "This boss is assisted by two ranged Dremora friends, a Mage and an Archer.",
          "The boss typically deals a heavy attack which can be blocked.",
          "Upon the death of his companions, the boss will spawn series of Flame Atronachs who typically can be ignored."
        ],
        "strategy": [
          "Deal with the two ranged assistants first as quickly as possible because the Mage and the Archer can randomly teleport in front of or behind you.",
          "**Tank** should keep the boss facing away from the rest of the group, and deal some AOE when possible.",
          "**Healer** should position himself between the tank and DPS to provide constant healing to low healthed allies or employ 'healing over time' effects at the earliest instance possible.",
          "Fight the boss from atleast an 8 meter range if possible to avoid the damaging red circles."
        ]
      },
      {
        "name": "Urata the Legion",
        "mechanics": [
          "Urata spawns 20 additional mobs which have to be cleared in order to fight him.",
          "She constantly spawns red circles on players to penalize those who stay still too long."
        ],
        "strategy": [
          "Attack the ads first and use them to attain ultimates faster. Avoid the red circles and continually attack at the same time.",
          "**Tank** should use taunts from range and stun the ads as much as possible.",
          "**Healer** should have an easier job of just keeping an eye on players getting damaged from the red circles."
        ]
      },
      {
        "name": "Xivilai Boltaic & Xivilai Fulminator",
        "mechanics": [
          "These two bosses are very alike and simple to strike down."
        ],
        "strategy": [
          "Just nuke the two of them and move on."
        ]
      },
      {
        "name": "Horvantud the Fire Maw",
        "mechanics": [
          "This boss often spews hot lava that shall vaporize players if not agro'd away from the team.",
          "He starts with earthquakes that cause rocks to spring out of the floor, which if not blocked can deal a lot of damage.",
          "Boss also stomps to cause red circles which are best avoided by spreading out."
        ],
        "strategy": [
          "**Tank** face the boss away from the group and roll out of the cleave attacks.",
          "Stay spread out from each other during the stomping and watch the ground for the red circles. Step out of them but stay near, as you will immediately have to go back to them to protect yourself from the damage.",
          "Use ultimates when possible to deal as much damage to ads and the boss."
        ]
      },
      {
        "name": "Ash Titan",
        "mechanics": [
          "The aggro will cause the boss to throw fire circles at your feet.",
          "The boss will also occasionally jump to cause waves of fire to push you back.",
          "There will be ads but they deal very little damage."
        ],
        "strategy": [
          "**Tank** should taunt the ads but keep the boss agro'd as much as possible. ",
          " Avoid the big red circles and heal through smaller ones. Always be ready to roll to avoid double red circles spawning at your feet.",
          "**Healer** must keep the tank alive to avoid losing to the boss.",
          "**Damage dealers** should just charge in and attack as much as possible while avoiding the waves and big red circles."
        ]
      },
      {
        "name": "Valkyn Skoria",
        "mechanics": [
          "This fight is very tough if you don’t have the dps for it, because it has something which we used to call “Enrage Timer”. Meaning that there’s only so much time that you have to kill it before it becomes impossible and you all die."
        ],
        "strategy": [
          " You will have 5 platforms available, which will be destroyed by the Dremora general after some time and Valkyn Skoria teleports to the next platform. Just run to the next platform as soon as possible and remember to stay together!",
          "**Flame Strike** - An exploding fire that emanates into various directions. It can be entirely avoided. The more you are on the move, the less damage you get and you shouldn’t get hit too often.",
          "**Tank** should definitely keep an eye out for his Heavy Attack, otherwise might lose control of him and/or be pushed into the lava.",
          "After having destroyed a platform and having teleported to a new one, Valkyn Skoria lifts his sword up high and shoot fire balls from it. Additionally, he will gain a damage shield and you need to destroy this before he stops doing his attack.",
          "Aimed at a random group member, the boss will imprison someone into a stone prison from which you have to break free. You can dodge roll it, but only if you notice it in time.",
          "During the fight the Boss can charge a Flame Bolt at a random group member, meaning you will be tossed backwards into the lava if you don’t block or dodge roll this attack.",
          "Upon destroying the platform and teleporting to a new one, as soon as he raises his shield and sword, Flame Atronachs will spawn. Best is to take them to the center and kill them in the DDs’ AoE, as they will die relatively quickly.",
          "**Hardmode** differs from the normal mode pretty much in having 2 platforms removed, which in turns means that you have less time to beat Valkyn Skoria. Only do this if you bring a lot of dps to the table, because otherwise this might be an impossible task. You can active the Hardmode in the far right and upper corner. On an altar you can find the scroll."
        ]
      }
    ],
    "link": "https://alcasthq.com/eso-city-of-ash-2-dungeon-guide/"
  },
  {
    "dungeon": "Cradle of Shadows",
    "description": "Cradle of Shadows is a group dungeon located in Shadowfen in The Elder Scrolls Online. It is part of the Shadows of the Hist DLC. It features Normal and Veteran modes.",
    "image": "https://imgur.com/rNiFY8e.png",
    "sets": [
      "Gossamer",
      "Hand of Mephala",
      "Velidreth",
      "Widowmaker"
    ],
    "bosses": [
      {
        "name": "Sithera",
        "mechanics": [
          "The tank needs to keep the boss and the adds with him/her at all times and keep her IN the light. You have every right to be scared of the dark here! If you try to attack her in the dark she will only receive 10% of all damage, so she must always be in the circle."
        ],
        "strategy": [
          "**Power up** – The boss will try channel an ability between her random poison spits which will make her stronger. This is extremely easy to spot and can be interrupted. So long as you interrupt every time, this mechanic will never actually happen!",
          "**Spiders** – The spiders are the same as the ones you encountered in the tunnel. The same rules apply. Keep them together, kill them with as much aoe as possible and keep them IN THE LIGHT!",
          "**Braziers** – Throughout the fight the braziers will go out! Be sure to move to the middle one at 50% and turn it on taking the boss with you. Then light the final one and take the boss to it at 30%. It helps if you can have one member keep an eye on the health of the boss and make an early run for the brazier to get a bit of a head start so that people are not in the dark so long.",
          "**Poison spits** – The boss will spit poison randomly during the fight at the person with agro, simply block these when they hit you, their damage is not too difficult to manage."
        ]
      },
      {
        "name": "Khephidaen The Spiderkith",
        "mechanics": [
          "This boss is simple to dispatch but can be made to be a lot more difficult than necessary. If ONE person doesn’t understand the mechanics with this and/or at least co-ordinate with the group it becomes a complete mess. The **tank** needs to taunt at ALL times and keep the boss in the light!"
        ],
        "strategy": [
          "**Heavy attack** – The boss will hit with a DEVASTATING heavy attack. The tank should be the only one getting hit by this and you MUST block!",
          "**Burst** – The boss will create a large spreading AoE and when it reaches full size it will explode. You as **dps and healers must stay OUT** of this. If it touches you, you are dead. Tanks can block it but it's not recommended, simply step out of it and get back in again when it is gone.",
          "**Spiders** – The spiders you have seen 100 times before already, keep them in the lights, control them and kill them. Do NOT run away or run around in circles, this will make things really difficult for the tank. The fight must be controlled.",
          "**Teleport** – After every Burst AoE she will teleport to a random brazier in the room and turn it off. During this phase shadows will appear and start shooting at the group. Get your team to turn the braziers back on asap else you will eventually run the risk of running out of lights. The shadows don’t last long but the light will get rid of them.",
          "**Shadow bolts** – Every time she teleports she will also cast an attack which will cast 4 shadow bolts at the ground, one at each player. This deals HUGE damage and knocks down. For some players this can be a guaranteed one shot. To prevent this, when she teleports you MUST keep your eyes open and look for the channeling of this ability and interrupt it asap!"
        ]
      },
      {
        "name": "Votary Of Velidreth",
        "mechanics": [
          "This boss is as simple as they get… BUT can kill even the most experienced group if they are not paying attention or get too comfortable. **The tank** should hold this boss in the MIDDLE of the room, NOT the corner."
        ],
        "strategy": [
          "**Spider adds** – During the fight very small spider adds will enter the room from the ceiling. These should die very fast to passive AoE damage on the ground if you have any. They need to die fast else they can cause a problem with small negative aoes and projectiles hitting the group.",
          "**Heavy attack** – Very simple here, a heavy attack should be something you are very familiar with by now, BLOCK when it is about to hit you. This should only be aimed at the tank unless a taunt has fallen off. If this aims at a dps or healer role be sure again to BLOCK.",
          "**Poison Circles** – During the fight the boss will place multiple poison circles on the ground which cause HUGE damage to anyone standing in them.",
          "**Feeding** – If the boss channels and tries to feed off of dead spiders, you MUST interrupt it. The boss can heal more than 10% per second and this fight will be a really long one if not paid attention too.",
          "**BOOM!** – The boss will make a MASSIVE spreading aoe which explodes when it reaches full size. This must be avoided at all costs! As soon as you see these, get OUT of it! THIS is why you use the middle of the room and not the corner. If you are in the corner, you have NO WHERE to go!"
        ]
      },
      {
        "name": "Dranos Velandor",
        "mechanics": [
          "This boss is every P.U.G’s nightmare, it is actually pretty simple but it is fast paced so people have to react quickly. The boss has several phases and there is a lot of AoE in the room so you must watch your feet. The tank should hold the boss still as much as possible and NEVER drop taunt."
        ],
        "strategy": [
          "**Shadows** – The boss will go immune to all damage. During this phase the statue in the middle will emit red waves of damage across the floor and 3 shadows will be placed around the room. You need to kill these as fast as possible and then pick up the red orbs that they drop. Once 3 orbs have been picked up the boss is able to be attacked again and will be stunned for a brief moment giving you a dps window.",
          "**Mortar** – The boss raise his hand in the air occasionally and a red blot will leave his hand and land on the floor with a large round aoe. Once it hits the floor it will split and do additional damage in different directions as it disappears. Be sure to ALWAYS stay out of this. When it is coming your way, move!",
          "**Tick Tick SPIN!** – The boss will spawn 2 adds with very low health and they are pinning whoever has agro to the ground, there is NOTHING the person pinned can do. This is why you must not ever let the tank taunt fall off. During the pinned phase the boss will wind up a HUGE heavy attack. If your group doesnt interrupt the TWO adds, the heavy attack will hit the target and kill them outright, guaranteed one shot!",
          "If your group are successful and they manage to release the target, **the player MUST BLOCK**! The heavy attack is still coming and you must defend yourself.",
          "**Teleport strike** – The boss will teleport strike from one group member to the next until all 4 have been hit, then he will go back to his original spot. The way to mitigate this is to simply BLOCK. Each player blocks and then he will move to the next! However the slight twist is that once he has connected with each player he will leave an aoe under the players so be sure to step out of this and not take any additional damage."
        ]
      },
      {
        "name": "Velidreth",
        "mechanics": [
          "This boss is a tricky one!! LOTS of mechanics, lots of unforgiving situations and random twists making the difference between a pass and a fail. The tank needs to keep hold of this boss at all times and if possible **hold her to one side of the room.**"
        ],
        "strategy": [
          "**Heavy attack** – The boss will fire off a simple heavy attack during the fight. It isn’t particularly powerful but should be blocked by whoever she is targeting. ",
          "**Flurry** – The boss cast a very small frontal cone aoe in the form of a flurry, simply block this and all will be fine but because of this the tank should NOT spin the boss on the group. A dps or healer can die fast to this.",
          "**Adds** – During the fight melee and ranged adds will spawn. These must be focused! The ranged need interrupting when they channel abilities and the melee must be watched carefully else they will uppercut you. If the tank can grab these and hold them on the boss without spinning her around this makes things a lot easier. Kill the adds first and then move on to her!",
          "**Don’t Move A Muscle!** – If she starts to climb into the ceiling, she will shout “don’t move a muscle” **Do NOT MOVE!** No matter what happens, do NOT move! Once the room starts to go light again she will jump down to the floor again. Look up at the celing, as soon as you see her wiggle, dodge roll immediately! If you dodge roll or move early, you are dead. Same goes for when you dodge too late",
          "**Devour** – Do not save your ultimates. Velidreth will look for the person saving up ultimate and draw them in. She will devour your ultimate pool rendering whatever ultimate you thought you were holding on to, USELESS. So the tip for this is, use your ultimates as soon as they are ready and/or use the cheapest ultimates you possibly can.",
          "**Draining orbs** – There are orbs flying around the room which sometimes change colour. Basically each ball will drain the resources relevant to the colour they are if you touch them. Green will drain your stamina, blue will drain you magicka, and red will of course drain your health. Avoid these at all costs!",
          "**Atronachs** – These are KEY for the catacombs. When the atronachs spawn 81% and around 51% you MUST focus them. Don’t push the boss, kill them fast. Each one will drop a light on the floor. Asign two members of your group to pick on up each. You will be split into two groups at random and one person of each group will be holding the light. If you don’t pick these up you are very unlikely to complete the next phase.",
          "**Banished to the catacombs** – The boss will banish the group to the catacombs and this will happen TWICE in the fight. Once at 66% and again at 31%. Both groups of two will be sent off, each with 1 light. What you need to do here is stay together and find your way through the map back to the middle. Find the open door ways and make your way to safety.",
          "The light is to save you from the dark so do not run away from your teammate else they will be snared and eventually die. There are some adds in the catacombs. Don’t try to focus these down because you WILL get OVERWHELMED. Keep down snares/roots to CC while they are chasing you. Each connecting path between each room has traps on the floor but the light will reveal them, so watch your feet and don’t stand on the red pads.",
          "If you are a really meaty tank and you are trying to save your group (last man standing) START a res then cancel it and interrupt the boss… THEN go back to the res and she won't try it giving you a window for recovery."
        ]
      }
    ],
    "link": "https://xynodegaming.com/cradle-of-shadows/"
  },
  {
    "dungeon": "Crypt of Hearts I",
    "description": "This is one of the first dungeons you have access to at level 22 or if you travel to the opening yourself at lower levels.",
    "image": "https://i.imgur.com/lVtBtxo.jpg",
    "sets": [
      "Ilambris",
      "Shroud of the Lich",
      "Leviathan",
      "Ebon Armory"
    ],
    "bosses": [
      {
        "name": "The Mage Master",
        "mechanics": [
          "This boss is very simple. He has 4 mage type enemies with him which must be controlled by the tank from the very beginning so they don’t run around. The dps and healer also need to pay attention to interrupts. The **tank** should hold everything as still as possible through out the fight and chain in any adds that try to run away."
        ],
        "strategy": [
          "**Heavy attack** – This is a pretty simple melee attack in the form of an uppercut and must be blocked. Any role can block this but it will only hit whoever is agroed. It does a lot of damage if NOT blocked.",
          "**Elemental Ring** – This is donut shaped AoE on the floor usually making the tank sit in the middle. Inside of it and outside of it is the safe area but if you touch the edges you will take a fair amount of damage, so avoid standing in this for long periods of time.",
          "**Negate** – Usually after the previous effect he will drop a negate bubble on top of the same AoE. If you are dps or healer make sure you are out of it, but as the tank, if you tough the edges, you take damage, in the middle is safe but NOW you are in a bubble. Stay inside, hold a taunt and block. The reason you will now be relying on your healer is because INSIDE the bubble you CANNOT use any magicka abilities until it has gone."
        ]
      },
      {
        "name": "Death's Leviathan",
        "mechanics": [
          "This boss is so much fun but can get incredibly chaotic if people do not pay attention. This fight is all about the tank controlling the boss. If the tank looses control of this boss it is all out mayhem and very hard to get damage on the boss let alone survive his enrage mechanics. This can be really simple or really difficult."
        ],
        "strategy": [
          "**Charge** – This is where your tank has to position the boss so that he can stay in the damage and not run around the room. When he charges he will go in a straight line aiming in the direction he is FACING at the time. So get your tank to position their back into a corner so that he runs straight at the wall. Every time he has finished charging move to another corner close by and repeat the process.",
          "**Burst** – After the charge ability he will stamp the ground and creat a fast growing large BURTS aoe. This can be blocked or dodge rolled and is very easy to spot. The damage is not so bad at this stage but you need to avoid it none the less. for dps, simply dodge roll out and then get back in when it is gone.",
          "**Enraged** – At low health the boss will buff himself with FIRE! His charge ability now emits a massive fire trail wherever he ran from and to, so do NOT stand in this. Also his burst ability now has an added fire damage burst to it. You can still block and dodge the initial damage BUT the second tick of damage will still hit you and you will be knocked over regardless."
        ]
      },
      {
        "name": "Uulkar Bonehand",
        "mechanics": [
          "The Boss is very but CAN wipe a group if you are not paying attention to BASIC mechanics of the game. The tank should turn the boss away from the group and hold on to the two adds while the group burn the adds with AoE damage."
        ],
        "strategy": [
          "**Whirlwind** – Every so often the boss will spin his weapon around his head in a small aoe damaging people inside of the circle. This is a very simple mechanic, stand out of it and you will not be harmed.",
          "**Heavy Attack** – The simplest mechanic in the game for a tank to put into practice. This heavy attack requires you to BLOCK. If you do not block you are dead! The wind up to this heavy attack can actually hit JUST before the attack connects so be sure to look out for this and block early. If you fail to block it is a guaranteed one shot!"
        ]
      },
      {
        "name": "Dogas The Berserker",
        "mechanics": [
          "A high dps group will make mince meat of this guy but we are here to learn about mechanics. Your tank has to be on his/her toes on this one since there are a lot of enemies to manage. Grab all the adds and hold a taunt on the boss. Keep the boss central so the group can kill everything in AoE as fast as possible while focusing single target stuff on the boss."
        ],
        "strategy": [
          "**Heavy attack** – Very so often the boss will aim a heavy attack at the tank this has a nasty knock down and a lot of damage so make sure you block it! Also this can sometimes be done from stealth so be sure to keep your eyes open for the heavy attack sparks effect in thin air if he vanishes and block EARLY.",
          "**Soul Teather** – Very much like the nightblade ability, the boss will occasionally stun the group and then life steal each member for 4-5 seconds. The stun can be broken free and you can block the initial damage."
        ]
      },
      {
        "name": "Ilambris Twins - Zaven & Athor",
        "mechanics": [
          "The final boss in Crypt of hearts I is actually two bosses at once. Killing one will enrage the other so you CAN kill them both together if you have a lot of damage but this is about mechanics. **Tank** should hold the blue boss out of the center circle, and keep a ranged taunt on the red mage boss. **The dps** should focus the mage and then once it is dead, put the blue one in his place and hold him in the middle."
        ],
        "strategy": [
          "__For Athor (blue boss)__: ",
          "**Heavy attack** – The heavy attack is HUGE, does a lot of damage, a massive knock down and is delayed. This MUST be blocked BUT block the second you see it. It will connect with the target before the visual for the swing actually happens so keep your eyes peeled and block as soon as you see this. This should always be on the tank but if something goes wrong the dps can survive it IF they block.",
          "**Bubbles** – Occasionally during the fight Athor will cast tiny lightning AoEs on the ground with a small dome covering them. Do NOT stand in these they hit you with a nasty amount of lightning damage. Just stay out of them.",
          "**Enrage** – Both bosses have enrage mechanics. **Kill zaven (red mage) first**, else the room will get filled with fire and it is hard to manage. When Zaven is dead Athor will enrage. The tank should take the boss to the center and your dps and healers should find their own space and gradually burn him down. Occasionally Athor will call down a rain of lightning. Just step away from it.",
          "__For Zaven (red boss)__:",
          "**Flame Burst** – Zaven will cast a MASSIVE AoE in the room, it will spread and explode. If you are in this you will be knocked down even if blocking. You need to get out of this asap and then get back in position once it is gone.",
          "**Fire Trail** – Occasionally Zaven will raise his hand aiming at whoever has agro. He will cast a straight line of flames across the ground. So if it is aiming at YOU, simply move to one side and let it pass. If this hits a dps or a healer, it is pretty much a one shot.",
          "**The wheel** – Spokes of flames will fire from the bosses feet. These are low damage, avoidable and not too much of a problem. Just keep your eyes peeled and either avoid them or have a heal to hand."
        ]
      }
    ],
    "link": "https://xynodegaming.com/cryptofhearts1/"
  },
  {
    "dungeon" : "Crypt Of Hearts II",
    "description" : "Veteran Crypt of Hearts 2 can be challenging. The dungeon has a skeleton theme about it and with it a lot of Undead.",
    "image" : "https://i.imgur.com/lVtBtxo.jpg",
    "sets" : ["Shroud of The Lich", "Leviathan", "Ebon Armory", "Nerien’eth"],
    "bosses" : [
      {"name" :  "Ibelgast",
        "mechanics": [
          "This boss is very simple. The boss spawns adds through out the fight so the tank will need to keep with the boss but of course be able to grab them as and when they enter the fight. They are based on health however so the faster the burn the faster they spawn. So do NOT dance around the room or this will get messy quickly. The tank should try to hold the boss as central as possible."
        ],
        "strategy" : [
          "**Adds** – Throughout the fight adds will spawn and these must be dealt with, the tank should try to taunt/chain as many as possible. FOCUS the healers and then go back to the boss. Be careful at low health of the boss however because a large flesh Atronach will come out of a portal to join the fight and he will need to be focused. He does have a nasty heavy attack which will need to be blocked if targeted.",
          "**AOE Circle** – The boss will randomly choose a target to place a LARGE circular aoe on the floor under them. If this is you simple move out of it. It is extremely easy to see and doesn’t move, so don’t panic, just move to the side and carry on as you were.",
          "**Heavy Attack** – The boss will wind up a HUGE heavy attack with a knock back added to it. Whether you are the tank or not, if this aims at YOU, you *must* block it! This will only aim at the person with agro, so if it is aimed at a dps or healer, the tank dropped the ball!"
        ]
      },
      {"name" :  "Ruzozuzalpamaz",
        "mechanics": [
          "This is a simple one but does require some co-ordination and for people to relax and not panic running around the room UN-necessarily because that WILL cause a wipe. Focus and pay attention to the mechanics and you won’t have a problem. The tank should hold the boss in the middle of the room and the group should surround her. Spread out and stand still to start with."
        ],
        "strategy" : [
          "**Chasing Aoe** – The boss will pick a player at random. A massive AoE will start chasing them. If you are not familiar with this do not worry, basically it means keep moving. If YOU are the target, step back about to the outer circle of your group and simple run around the room in a large circle to avoid it, and when it has gone come back into your position. Just be sure you do not overlap the AoE onto the group.",
          "**Spiders** – Throughout the fight swarms of spiders will spawn. Stay in position, let  the spiders come to the middle. The tank can chain them, taunt them but if you start running around the room when you have agro they are incredibly difficult to control. So let the tank do their job, let the spiders come in and get as much AoE damage down as possible. They do not have a lot of health so are not hard to kill.",
          "**Heavy Attack** – This is pretty simple stuff, she occasionally heavy attacks and this needs to be blocked. Even if you are a dps or a healer, if she is on you, be sure to block this, or you will get a nasty knock back and can make the fight a bit messy.",
          "**Cocoon!** – During the fight the boss will randomly wrap up a member of the group in a web cocoon! This is when your group has to pay full attention. If anyone is in a cocoon this is when your group needs to run over to them and hit the synergy button to release them ASAP! This is a key mechanic above all."
        ]
      },
      {"name" :  "Chamber Guardian",
        "mechanics": [
          "This boss is one of the easiest in the dungeon honestly BUT can get messy depending on the group’s experience. The tank should grab the boss and simply hold it in the middle of the room. Try to keep it as still as possible to not remove him from possible dps aoes on the floor."
        ],
        "strategy" : [
          "**Heavy Attack** – Pretty simple stuff here, whoever has agro will occasionally get heavy attacked! As with every other heavy attack in the game, this needs to be BLOCKED!",
          "**Skeletons** – Throughout the fight skeletons will spawn, these need to be killed quickly else they can overwhelm you with multiple spawns. They can be controlled by the tank and killed with low to mid aoe damage, BUT if your group is lacking damage overall, focus these down as soon as possible.",
          "**Fear** – The boss will invoke a spirit throughout the fight to fear the group. You must break free as soon as possible. A lot of the time the fear is followed by a heavy attack so if you don’t break free fast enough it will hurt. Key points basically are, hold him still, and break free fast so you don’t run him around the room."
        ]
      },
      {"name" :  "Illambris Amalgam",
        "mechanics": [
          "This boss looks worst than he is. To start with you will be greeted by the Ilambris twins, Killing ONE of them will result in them disappearing and spawning the boss from the pile on the ground. Get in a nice circle, make sure the tank has the agro of the boss and holds him STILL on the pile. NEVER move the boss."
        ],
        "strategy" : [
          "**Skeletons** – As with most Bone Colossus types the boss will spawn 3 melee skeletons from time to time, these are very low health and AoE will kill them pretty fast, even low damage. But the tank CAN control these with talons/immobilize abilities/status effects and also taunt them. Simply hold them still, no need to run around.",
          "**Larger skeletons** – Another spawn of adds will come into the fight occasionally. These have a fair amount more health than the basic skeletons. However, just like the basic ones, these can be taunted and controlled by the tank. Do NOT run around the room else these will kill you. They can die easily to AoE damage and/or ultimates but if you run, it is almost impossible to control.",
          "**Stomp** – The boss will occasionally stomp the ground, when this happens, simply step out of it or block. Blocking will negate a HUGE proportion of the damage so is probably safer.",
          "**Rain of Fire** – Low health the boss will enrage and constantly rain fire on the ground around the group. All you need to do here is step to one side before each one lands. Watch your feet and kill the boss."
        ]
      },
      {"name" :  "Mezeluth",
        "mechanics": [
          "For this fight, the tank needs to be taunting the boss and keep agro at all times but above all, positioning is KEY! Look at the room as a clock face. You have 4 players. EACH player takes quarter of the clock. So, people stand at 12 o’clock, 3 o’clock, 6 o’clock, 9 o’clock. DO NOT move from these positions. everyone should have their OWN quarter of the clock! failure to do this WILL result in a wipe."
        ],
        "strategy" : [
          "**Ground Fire** – Very so often the boss put her staff in the air channeling an ability, this will place a nasty AoE under the target of her choice and makes positioning difficult, so be sure when you see this to INTERRUPT her either with a bash or a skill that does such. Do not rely on everyone else to do it, EVERY player can interrupt targets.",
          "**The Wipe** – The boss will pull everyone to her feet in mid air. A spreading AoE will appear under your feet and attach itself to you. Yes that means it follows YOU. During this phase an AoE will appear behind each player!THIS is why you must be in the quarter clock formation. AVOID landing in the ground aoe on their side and AVOID all other players. If your body overlaps another aoe, when they explode You will DIE."
        ]
      },
      {"name" :  "Nerien'eth",
        "mechanics": [
          "The boss although taunted has SOME mechanics which are random. So everyone must be on their toes. The tank needs to keep a taunt on the boss at all times and the group should be in a nice circle around the boss as not to stack, if you stack it becomes a problem because random targeted players cannot tell WHO is the target. So give each other some room."
        ],
        "strategy" : [
          "**Lich Crystals** – The boss will raise his hand in the air, when he does this he will spawn lich crystals around the room. A chain will come out of the ground and then a big AoE burst will come from them. These are extremely easy to avoid, simply step out of the AoE.",
          "**Flying Skull** – Occasionally the boss will target a random player. He will start channeling for a brief moment and then let rip with a projectile flying skull at the player of his choice. If while channeling he is looking at YOU, then YOU are the target. Once it starts flying at you, dodge roll it. Failure to do so will result in MASSIVE damage and a knock down. Spread out so you can see who the target is!",
          "**Teleport Blast** – The boss will teleport from time to time at a random player, when this happens you must get away from him ASAP! Wherever he lands he will cast a massive spreading AOE on the ground from his feet. It is large enough for a single dodge roll to not be enough if you are too slow. If this hits you, unless you are fairly tanky OR the tank you are pretty much dead in one shot.",
          "**Ghosts** – There are 3 “well” type places on the map with a grill over them. When the boss teleports to these he will release two ghosts. Kill these fast as you will get overwhelmed. **If you are going for hardmode you MUST keep these alive**. In order to complete hard mode you MUST have 4 ghosts alive when the boss reaches for the sword! (35% health).",
          "Taking The sword! – At 35% health the boss will reach for the sword in the center of the room. This is “go time!”. The group needs to stay close to the boss. The tank should hold the taunt and the group should have a tight circle close to the boss.",
          "When the boss grabs the sword the group will be stunned. The boss will then choose a random player in the group and hold him/her in mid air and try to drain them. The player in question must synergies to resist the drain and at the same time the group must do as much damage as possible to remove the new damage shield from the boss and drop the player to safety."
        ]
      }
    ],
    "link" : "https://xynodegaming.com/cryptofhearts2/"
  },
  {
    "dungeon" : "Darkshade Caverns I",
    "description" : "This is one of the first dungeons you have access to at level 42  or if you travel to the opening yourself at lower levels.",
    "image" : "https://imgur.com/iAFPj32.png",
    "sets" : ["Netch’s Touch", "Armor of Truth", "Strength of Automantons", "Sentinel of Rkugamz"],
    "bosses" : [
      {"name" :  "Head Shepherd Neloren",
        "mechanics": [
          "This boss is very simple and has very little health but she heals a LOT so the key point to this fight is making sure that each time she tries to do so, you INTERRUPT. The heals are incredibly strong and to a group with low damage who forget to interrupt her, this can be a pain."
        ],
        "strategy" : [
          "**Fireball** – This is a pretty basic attack but it does have a splash/spread affect to it, so try not to stack up to much and stay out of it when it lands. Apart from that her basic flame attacks especially while the tank has proper agro, is a minor issue and really doesn’t hurt that much at all. However if you do get caught, you should shield/block and just watch where you stand.",
          "**Healing** – This boss heals more than she does attacks! She has two major heals, one which will heal someone else and one which will heal herself. The single target one resembles that of traditional targets with a stream like affect and CAN be interrupted. Make sure you stay on top of this in order to prevent her healing her allies.",
          "The other heal is very similar to that of the templar healing skill line. She animates into a short duration prayer state and when it has finished channeling she receives a HUGE heal (also ticks over time). You MUST interrupt this else it will cause some big problems to groups with lower damage than most. The way to pass this boss, is to STOP her from healing."
        ]
      },
      {"name" :  "Foreman Llothan",
        "mechanics": [
          "This boss is relatively simple with some punishing effects if you don’t simple stick to the rules. It is a fairly mobile fight and people need to be on their toes, while dealing with places and cast AOEs as well as multiple waves of adds depending on how fast you dispatch the boss!"
        ],
        "strategy" : [
          "**Move** – Periodically the boss will swap position. This is every few seconds and his initial movement is triggered once the first player gets too close. He moves every 10-12 seconds and spawns anything UP TO 6 kwamas. They all have very low health and can die fast to general AOE damage but make sure your tank controls them.",
          "**Burst** – When he is about to run each time, he will cast a spreading AOE shock blast, if you are caught in this you will take a LOT of damage. When you see that mechanic, dodge roll OUT of it and let him reposition himself.",
          "**Poison Vials** – Throughout the fight he will throw poison vials onto the floor aiming randomly to someone. These do nasty AOE damage to whoever is caught in them. Do NOT get caught by these and if you do, get out of them as soon as you can. A tank will be able to stand in them although there is no need, but a dps or a healer unless healing a LOT will die in only a few ticks."
        ]
      },
      {"name" :  "The Hive Lord",
        "mechanics": [
          "The basic rule for this boss is to KEEP HIM STILL, get everyone in close and watch your feet!"
        ],
        "strategy" : [
          "**Lunge** – A very simple RULE rather than mechanic. IF you run away from the boss rather than standing about 5-10meters away he will jump on your head! Simple. Stay close and he won’t do it!",
          "**Spawn Kwama** – A very small AOE effect will appear at the bosses feet. Get out of the affect (it snares and hurts) then 3x kwama will spawn. They are very weak and can be killed fast with AOE. Your tank should control them and NO ONE should be running away.",
          "**Slam** – A small cone attack slam, in the direction of whoever has agro. This is avoidable and blockable so be sure to block if it is aimed at you. It doesn’t hit too hard though.",
          "**Ground Pound** – He pounds the ground repeatedly hurting everyone inside the massive AOE every time he hits the ground until he stops. BASH/INTERRUPT him and he WILL stop."
        ]
      },
      {"name" :  "Cavern Patriarch",
        "mechanics": [
          "This boss one of the easiest in the dungeon. A big squid looking netch with bad breath basically. He will always attack whoever has agro so your tank should simply hold him still on the spot while your dps and healers stay behind him spread out."
        ],
        "strategy" : [
          "**Heavy Attack** – As simple as it sounds, the boss has a heavy attack. Whoever has the agro simply block it. It barely scratches and you don’t need to run around the room.",
          "**Poison** – This ability is pretty huge and does quite a bit of poison damage over time if you are caught in it, BUT it is placed on the ground so very easy to avoid. All you have to do is step out of it and you are safe. This is also interruptible if you are fast."
        ]
      },
      {"name" :  "Cutting Sphere",
        "mechanics": [
          "He is small, has a few adds around him which the tank NEEDS to pick up fast before they overwhelm the group and above all keep this guy as still as you possibly can. If he gets loose it is all over. Recommended for you to spread out a bit so you don’t all get hit by the same thing at once."
        ],
        "strategy" : [
          "**Dart** – A really nasty long ranged heavy attack which must be blocked. This should only hit the tank but if the taunt is dropped or you don’t have one you MUST block this.",
          "**Slam/Jump** – Occasionally the boss will jump up in the air and quickly slam back down again onto the ground. A small AOE will visually show its range but you do NOT want to get caught in this.",
          "**Steam Attack** – Occasionally the boss will charge up a kind of swirling steam attack in a random direction, this is devastating to a dps so avoid it at all costs BUT this can be interrupted. You are looking for a small round AOE affect on the floor moving in a straight line. DON’T get hit!",
          "**Spin** – The boss will go into a craze and spin for a few seconds, each tick of damage will hit anyone in the area and he will home in on the agroed target. The tank needs to keep the boss still and BLOCK the damage. If they catches a DD or Healer, they will die unless they kite the boss around."
        ]
      },
      {"name" :  "Sentinel Of Rkugamz",
        "mechanics": [
          "The final boss in Darkshade caverns is pretty simple but all manner of things can go wrong. He has 3 basic mechanics which are VERY easy to determine which is which because they are colour coded by the lights on his body. The tank should keep this boss as central to the room as possible at all times and pay close attention to the colour changing."
        ],
        "strategy" : [
          "**Decapitate** – This is the mechanic that happens when the boss is YELLOW. While he is yellow he will aim at whoever has agro and will do 3 heavy attacks. These heavy attacks have a cone affect on them too so ANYONE caught in it will get hit. The tank MUST block or it is dead. Do NOT spin the boss. Try to keep him still, and if you are a dps or healer do NOT stand in front of the boss.",
          "**Lightning** – This phase happens when he is blue. He will raise his arm and fire shots into the air. These will land on the players head and the way to avoid the damage is very to keep close to the boss while keeping up your damage/heals and circle him slowly moving out of the way of each falling meteor shock pool.",
          "**The Spin!** – When he turns RED, he will choose a random target. He will spin doing physical damage every tick inside the AOE and SLOW you down with a snare. So if you get hit once you are pretty much dead and **he cannot be taunted**. The trick to this is to keep moving",
          "Whoever has his attention needs to move in a reasonable sized circle to keep him away from the teammates, try to gauge it so that the circle makes him deliberately stay INSIDE the damage already placed on the ground by your group.",
          "**Spiders** – At 25% and under he will spawn dwemer spiders in the room. They are usually pretty spread out, and they just sit in little green circles. IF he touches the circles he will heal, IF he does not, he wont. So your call. Kill them if you want, or simply keep him away from them. They are not a real threat."
        ]
      }
    ],
    "link" : "https://xynodegaming.com/darkshade-caverns-1/"
  },
  {
    "dungeon" : "Darkshade Caverns II",
    "description" : "This dungeon you will have access to at level 42 or if you travel to the opening yourself at lower levels.",
    "image" : "https://imgur.com/iAFPj32.png",
    "sets" : ["Netch’s Touch", "Armor of Truth", "Strength of Automantons", "Engine Guardian "],
    "bosses" : [
      {"name" :  "The Fallen Foreman",
        "mechanics": [
          "This boss is very simple but the ONE major mechanic can wipe groups if not careful. The tank should position the boss in the center of the room and hold the agro while also pulling in as many of the adds as possible. There are lots of adds to deal with and general AoE should be able to kill these fast, but people must stay on top of interrupts if archers try to channel abilities."
        ],
        "strategy" : [
          "**Fireball** – A simple basic attack which should only really be directed at the tank. Blocking will prevent this from being any real threat but to be honest the damage is so low that any healer or even a vigor will keep this from doing any serious damage to a tank.",
          "**Spinning Flames** – The boss will raise his staff in the air and spin a flame ability slowly around his head. You have two options, follow it around from behind or in front and just circle the boss. So long as it doesn’t touch you, you are fine. Pay attention to it and don't get caught. This ability alone if not paid attention to is capable of wiping an entire group."
        ]
      },
      {"name" :  "Transmuted Hive lord",
        "mechanics": [
          "This boss should be taunted at all time and turned away from the group. DPS and healers should NOT stand in the boss's face. In the mean time the tank should also control the 2 scribs that spawn with the boss. These can be tricky."
        ],
        "strategy" : [
          "**Scrib stuns** – The Scribs can fire off heavy attacks which must be blocked but above all they do channel abilities. Keep your eyes peeled, if you do NOT interrupt the scribs, they will pin players to the ground and drown their resources. This is unbreakable too so you will literally have to go through the motions while being hit. Interrupting these is KEY. Killing them just makes them respawn.",
          "**Slam** – The boss will occasionally slam the ground doing moderate AoE damage, heals should keep this from being a problem, it is not a one shot mechanic. However the tank should keep a taunt up as much as possible.",
          "**Slam and damage shield** – At low health the boss will enrage, gain a damage shield and violently slam the floor repeatedly. This will continue to happen UNTIL you do enough damage to take his damage shield away. Your healer really needs to be on point here because in a low dps group although this is completely manageable, the longer the shield is up, the longer people have to be kept alive for."
        ]
      },
      {"name" :  "Transmuted Alit",
        "mechanics": [
          "This boss is actually 3 bosses in one and they are connected, so you must pay attention to the fight. The tank must taunt all 3 of them and face them away from the group else they will get loose and start causing problems. Do not run away, they MUST stay together."
        ],
        "strategy" : [
          "**Jump** – The boss jumps in the air and slam back down again in the form of a heavy attack. The tank you should block this to prevent knock down. If you are a dps or a healer and for some reason they are hitting you, the same applies, make sure you block.",
          "**Breath** – A very small AOE effect will appear at the bosses feet and this will be aimed at whoever has agro. Again this should be on the tank and people should not be standing in front of the boss's, they are turned away from the group for a reason.",
          "**Revive!** – The damage on these enemies must be EVEN. Do not over burn one target. When an Alit dies, after a few seconds if the rest are not dead they will Revive with around 25% hp. Kill them all together if you can to prevent constantly fighting the endless revive mechanic. Pace your single target per boss and keep up an even amount of AoE."
        ]
      },
      {"name" :  "Grobull The Transmuted",
        "mechanics": [
          "This boss is the PUG killer and is not as hard as it looks once you break down the mechanics. The trick to this one is knowing WHAT to kill and WHEN."
        ],
        "strategy" : [
          "**Lightning Shield** – This boss while floating around has a lightning shield surrounding it. ALL projectile damage will be reflected at the caster! The tank can taunt the boss since that is not reflected but the negative effects can be. So be careful. All damage will only hit Grobull for 10% if not reflected so don’t waste your time hitting him.",
          "**Charge attack** – The boss will try to charge/shock players which will stun, you MUST break free from this.",
          "**Ground lightning** – This very easy to spot large circle of lightning MUST be avoided, you can be slowed, stunned and killed inside of it, avoid it at all costs.",
          "**Netch Swarms** – MANY small Netch swarms will come into the room, the tank should try to pin these as much as possible while the group throws down as much AOE as possible. You will have to move a lot to avoid the boss but stay together. Each killed add will hit the boss with a charged ability and once the boss has been hit by enough of them he will sit down for 10s. This is where you damage the boss as much as possible!"
        ]
      },
      {"name" :  "Mech Army",
        "mechanics": [
          "A MASSIVE army of mechs sitting outside the door to the last boss! The tank and healer are under HIGH pressure on this particular encounter. Be aware of your surroundings, taunts and cc must be applied to pin and/or chain in the ranged targets and the group must NOT run around the room. Running will prevent you from getting heals and also make you pull increased amounts of enemies.",
          "Position your group in a safe place away from the army, once you have agroed one of them from range, they will steadily come to you in waves. Fast but controlled. If however you go too close you will pull them all at once and it is game over."
        ],
        "strategy" : [
          "**Spiders** – These are close ranged and can be controlled easily but they must die fast. These will charge up a lightning bubble and all mech army enemies can run over to these and charge themselves with lightning increasing their damage output. Do not let them do it!",
          "**Spheres** – Ranged targets with nasty ground AoEs and darts that fire at the group. The tank needs to pull these in and pin them as fast as possible so they don’t pick off the dps.",
          "**Centurions** – The BIG ones, these are easy to spot and they are easy to get taunts on but these must be grabbed fast, they can almost one shot a squishy dps and can cause wipes. The tank should ALWAYS make sure these are turned away from the group. If you are a dps/healer and these are on you, make sure you block until they are controlled."
        ]
      },
      {"name" :  "The Engine Guardian",
        "mechanics": [
          "Your tank in this fight, plays debuffer, controller and protector! The boss cannot strictly be taunted and will run around the room in a circle in the direction of it’s choice. BUT you can still apply a taunt to debuff it with major fracture and breach to increase the damage done by your team. This boss moves all of the time apart from when it changes phases so your damage needs to be carefully applied."
        ],
        "strategy" : [
          "**Poison** – The room goes green and everyone takes damage constantly, healers and shields from the tanks will help and are essential. During this phase you can get VERY close to the boss if you are doing damage and you will not be hit with any additional damage.",
          "**Fire!** – The boss will spin his head while walking emitting a HUGE flame thrower in 360 degrees, do NOT go near him, stay ranged. In the mean time he will fire mortar shots at the ground and they will explode in large circle aoes of fire. Stay OUT of them. When he sits down AFTER the fire it is NOT safe. No matter what phase is next, he will still do one more final flame thrower spin, stay away until it is actually gone.",
          "**Lightning + Spheres** – This phase the boss will zap anyone close by so do NOT stay near him else you will die fast, ranged damage only. Also during this phase 3x spheres will appear and these MUST be killed. The tank needs to chain/pull them together and pin them down while the group kills them fast. If you do NOT focus these you will get overwhelmed. They throw ground AoE effects and heavy attacks, if you see this, BLOCK!"
        ]
      }
    ],
    "link" : "https://xynodegaming.com/darkshadecaverns2/"
  },
  {
    "dungeon" : "Depths of Malatar",
    "description" : "This is a challenging dungeon in Veteran modes. Players should form a well-geared party at endgame level.",
    "image" : "https://imgur.com/7Oc9xra.png",
    "sets" : ["Scavenging Demise", "Frozen Watcher", "Auroran’s Thunder", "Symphony Of Blades"],
    "bosses" : [
      {"name" :  "The Scavenging Maw",
        "mechanics": [
          "This can be simple or a complete mess! This will take some co-ordination. The tank will need to focus, be very careful of positioning, do NOT drop taunt, and above all collectively, stay together as a group during the mechanics. Splitting up is a BAD idea."
        ],
        "strategy" : [
          "**Breath** – This boss does have a nasty frontal cone shaped breath attack. This does high damage over time and needs to be avoided. If you are dps or healers and you stand in this you WILL die. The tank must try to keep the boss faced away from the group and block this while staying alive. If you run around the breath will follow you and you will end up spinning this onto the group and they will wipe.",
          "**Spit** – The boss fire a nasty poison spit at the tank (or whoever has agro). When this lands, anyone standing in it will take HUGE damage over time. Most tanks will not be able to stand up to this. Step backwards out of it with the boss (maintaining a taunt) and when the second one lands do the same (walk backwards). Once you are out of BOTH of the aoes you will be safe. The dps and healers should follow the tank’s path.",
          "**Heavy attack** – The boss will Launch a heavy attack and if this is on the tank a simple block will suffice. If you miss you are going to be knocked down and most likely die.",
          "**Shadow Jump** – The boss will vanish into the air and a heavy attack mechanic (white sparks) will be aimed at the group, presented by a spreading AoE under the feet of the players. When the AoE hits is peak and he is about to HIT, dodge roll out of it and you survive. If you don’t you will be killed!",
          "**Hide and seek!** – The boss will disappear and you will need to find him, BUT aoes will spawn out of the ground, which you MUST avoid. Adds will spawn which need to be killed and if you FIND the boss. Whoever finds him will be fed on and pinned to the ground. Make your TANK lead the group and everyone must STAY TOGETHER! When someone finds the boss you must interrupt the boss to get them off of your team mate.",
          "__Key points__: Stay together, kill adds, avoid AoEs, interrupt the boss when he jumps out and pins whoever finds him. If you stick to this, you will be fine."
        ]
      },
      {"name" :  "The Weeping Woman",
        "mechanics": [
          "If you try to NUKE this boss and you don’t have good AoE damage, you will get overwhelmed with adds and these adds are NO picnic. These can heavy attack a dps and one shot them, they can even one shot a tank! So watch your feet."
        ],
        "strategy" : [
          "**Geyser** – Multiple geysers will spray out of the ground. If you get hit by these you will be suspended in the air and take HUGE damage. Watch your feet and don’t stand in these!",
          "**ICE** – This is extremely easy to see. You will get 2 types of AOE attacks in the room which look like big whirling ice effects. These must be avoided following the description of each type below and at low health you will get BOTH.",
          "__Outside AOE__: This is a big ring around the outside of the room which you need to avoid by staying in the middle of the room.",
          "__Inside AOE__: This is the same as the above but it is in the middle instead. Simply do the opposite of the above and stay on the outside.",
          "__Execute AOE__: During low health you will get BOTH of these AoEs and there will be a thin strip between the two which you must stand in to avoid them both.",
          "**Ice Atronach** – These adds must be focused. They have huge heavy attacks and put nasty stunning and immobilizing high damage based aoes on the ground. When these are up stop focusing the boss and kill them as soon as possible.",
          "**Small Ice Aoes** – These are pretty much the same as the AoEs the Atronachs can place just a bit larger, watch your feet. These usually happen before the Geysers spawn.",
          "**Watchers!** – These adds MUST die as a priority target at ALL costs and the tank must have these taunted at ALL times. They have high health, they have AoE attacks and their heavy attack can one shot even a tank if they are not blocking. DPS and healers CANNOT block their heavy attack. If one of these is swinging at you, time it well and dodge roll. They spawn at 75%, 55% and 35% health."
        ]
      },
      {"name" :  "Dark Orb",
        "mechanics": [
          "There are 4 mechanics that have to be understood as well as a main target and SO many adds! Your tank has to be not only strong, but capable of holding agro on MULTIPLE targets and keeping them OFF the group. The main focus is of course the Dark Orb, but during the fight at health % the dark orb will introduce new mechanics which together you must focus before killing the main target."
        ],
        "strategy" : [
          "**Basic adds** – During the fight different basic adds will spawn, melee, archer and mages and these are fairly low health. The tank should pull these together as soon as possible and they should be killed by the group. These are not a real threat but on top of the BIG adds that are coming, can get a little overwhelming, so be sure to kill these, and interrupt arrow spray type abilities!",
          "**Aurorans** – These adds will spawn through out the fight and there are 4 different types: __Radiant Auroran__ (Jesus beam), __Phosphorescent Auroran__ (ice), __Blazing Auroran__ (fire), __Scintillating Auroran__ (lightning). Each one has different effects but all are deadly! They can cast dawn breakers, different elemental effects and frontal AoE. The tank MUST grab these and keep them faced away from the group at all times.",
          "**ORBS!** – During the fight the Dark orb will spawn OTHER orbs in the room as well as the adds! This is when you need to take your focus off the main target and focus the orb in the room. There are 4 types of orbs:",
          "__Radiant (yellow)__ – These can affect the group with healing debuffs.",
          "__Phosphorescent (blue)__ – These cause ice damage and place ice AoEs on the ground which MUST be avoided however they do spawn an ice pillar in the middle of them and they can be killed with JUST a light attack. The healer will need to focus heals to anyone close to these due to the amount of AoE damage they emit.",
          "__Blazing (red)__ – These call down meteors to each player and when they land they burst into multiple floor based moving AoEs. You must avoid the meteor and THEN get in the gaps between the scattered AoEs. These are tricky and must be learnt to be dealt with FAST.",
          "__Scintillating (purple)__ – These cause lightning damage and can cast multiple fast paced splashes on the ground coming from EACH player. Moving in a fast tight circle will make you avoid the damage and let them disburse but if you do not, you will get overwhelmed with damage and die fast!",
          "**TACTICS!**: Focus the Dark orb, when the adds spawn get the tank to pull them all into the corner and focus them with AoE and ultimates. While orbs are present, KILL the orb and THEN kill remaining adds before going back to the main orb in the middle."
        ]
      },
      {"name" :  "King Narilmor",
        "mechanics": [
          "This is where a completely new mechanic comes into play. You start off fighting the boss in the middle of the room with the tank turning the boss away and interrupt mechanics. The boss will split into 4. The tank needs to taunt ALL bosses and manipulate their positioning with range to get them as close to each other as possible while MAINTAINING taunts and interrupt them. This is gona get tricky!"
        ],
        "strategy" : [
          "**The Split!** – The boss splits into x4 reflections each with a damage and only ONE of them is the real one. Each time the boss splits up, get the 2 dps to focus on ONE target. If the damage shield falls off and that target disappears, if is a fake one and move on to the next. HOWEVER, if the damage shield falls off and it continues to take damage STAY on THAT BOSS!",
          "The tank at this point needs to keep taunts and interrupts while trying to carefully position them as close to each other as possible to prevent lots of running around the room.",
          "**Against the elements!** – The boss and every reflection can have a RANDOM color (blue/red/yellow/purple) and yes unfortunately if you didn’t pay attention to the previous fight this will make NO sense.",
          "__Yellow__ – Affects the group with (lifesteal) healing debuffs and can cast Radiant Oppression which can and MUST be interrupted.",
          "__Blue__ – AOE Ice damage as well as a spreading ice blast (don’t stand in this) and place ice aoes on the ground which MUST be avoided however they do spawn an ice pillar in the middle of them and they can be killed with JUST a light attack.",
          "__Red__ – These call down meteors to each player and when they land they burst into multiple floor based moving aoes. You must avoid the meteor and THEN get in the gaps between the scattered AoEs.",
          "__Purple__ – These cause lightning damage splashes and can cast multiple fast paced splashes on the ground coming from EACH player. Moving in a fast tight circle will make you avoid the damage and let them disburse but if you do not, you will get overwhelmed with damage and die fast!",
          "**Power Of The Light** – This is pretty much the same as the Templar ability. This will be cast onto one player and over time it will absorb more damage before it explodes. Be sure to interrupt if you see the boss or any reflections channeling.",
          "**Dawn Breaker!** – The boss/reflections will occasionally cast a dawn breaker sword slamming animation and will do HUGE damage to people in front of it. Do not stand infront of the bosses when this happens and if you are the tank, be sure to block.",
          "**Tharayya and Quintus!** – During the fight Quintus and Tharayya are fighting! Keep heals on Tharayya to stop her from getting into trouble. If the Ghost gets the better of her, the bosses will get MASSIVE damage shields and the fight will get a LOT tougher. Be careful! The healer has a lot to do here keeping the group up and the NPC alive."
        ]
      },
      {"name" :  "Symphony Of Blades",
        "mechanics": [
          "This boss is a simple fight IF you understand the colours mechanics. However above all this fight is 100% built on co-ordination and footwork. There is NO rush and there is NO dps requirement. This fight really is ALL about mechanics! The tank should hold the boss in the center of the room and the gorup should stand in a triangle formation BEHIND the boss. Never drop the taunt on that boss!"
        ],
        "strategy" : [
          "**Heavy attack** – This is a very simple and obvious mechanic, the boss will hit with a large wound up heavy attack and this MUST be blocked. If for some reason you are not the tank and the heavy attack is coming to you, time it well and DODGE roll it. Do not run away do NOT try to block, you WILL die.",
          "**AoE and Stun** – One player in the group will be picked at random and a spreading AoE will spawn under their feet and be connected to them. Simply block while it pops and when it does, break from from it.  Stay as still as possible and do not put it on top of your team mates. If someone else has this on them do NOT run into the aoe.",
          "**SPIN!** – The boss spins his swords and has an AOE showing the distance in which the spin will reach. Prior to this you get a brief warning of the AoE spreading. Anyone caught in this spin will die unless they are a tank. Some tanks can stand still and block it, others may want to walk back wards holding block to slowly kite the boss until it is over. DPS and Healers should just stay out of the spin.",
          "**Sword Throwing** – The boss will channel an ability where he will look like he is hugging himself. This can be interrupted but if NOT he will throw his swords spinning out in front of him and then they will return again. This deals moderate damage and is not too much of a threat to the tank but should be avoided by the dps and healers.",
          "**THE WALL**– Boss will spawn a ghost wall. Basically if you touch it, you die. BUT you can KILL the ghosts! There will be two walls. One in front and one behind. Simply get your group to focus on ONE ghost and kill it, then get in the new gap to be safe and let the wall pass. The easiest option most of the time is to agree on the middle target. That way the tank really doesn’t ever have to move and you can continue as normal.",
          "**Aurorans!** – During Health % stages of the boss, as well as the wall phase, the boss will go IMMUNE! When this happens there will be 4x slow walking Aurorans coming from each corner of the room. Red, purple, yellow and blue, each one represents the damage types and effects from previous bosses. You need to kill the Aurorans of YOUR choice. Each one that REACHES the boss will dissolve and buff him with THAT effect for 40s",
          "If he consumes a yellow add he will be able to apply a heal debuff to the group and a Jesus beam to the tank.",
          "If he consumes red he will apply meteors.",
          "If he consumes blue he will spawn ice aoes and pillars and aoe ice damage.",
          "If he consumes Purple he will spawn nasty lightning splashes.",
          "**ORBS!** – During the fight the orbs from the “Dark Orb” boss will appear in the room with a random colour! This is when you need to take your focus off the boss and get the orb down as fast as possible. Orb ALWAYS takes priority! UNLESS there is a wall coming in which case, wall first, orb second, boss last!",
          "__Yellow__ – These can affect the group with a healing debuffs",
          "__Blue__ – These cause ice damage and place ice AoEs on the ground which MUST be avoided however they do spawn an ice pillar in the middle of them and they can be killed with JUST a light attack. The healer will need to focus heals to anyone close to these due to the amount of aoe damage they emit.",
          "__Red__ – These call down meteors to each player and when they land they burst into multiple floor based moving AoEs. You must avoid the meteor and THEN get in the gaps between the scattered aoes after wards. These are tricky and must be learnt to be dealt with FAST",
          "__Purple__ – These cause lightning damage and can cast multiple fast paced splashes on the ground coming from EACH player. Moving in a fast tight circle will make you avoid the damage and let them disburse but if you do not, you will get overwhelmed with damage and die fast!",
          "**THE FINAL FIGHT!** – At 11% health or below the boss will go into the Celestial Realm and drag you down with him. His MAX health doubles and his health goes up to 50%. So you have over 7million health to get through. The tank needs to taunt the boss at all times and keep the boss faced away from the group. When you first spawn into the other realm the boss is so busy putting down long ranged attacks that he in fact wont move.",
          "The boss now has ALL 4 element type attacks: __Radiant__ 5 second heal debuff and jesus beam on the tank. __Lightning splashes__ tight circles away from people to kite your splashes away from you. __Meteors__ avoid the impact and then avoid the splash from the center of them. __Ice__ kill the pillar and don’t stand in the AoE",
          "WHILE all of this is happening Orbs will enter the room with a random colour and these must be your 100% focus! Kill the orbs! The boss isn’t going anywhere, get them down at all costs.",
          "The walls are back…they are smaller walls, so you can run AROUND them rather than killing the ghosts, but you are going to get  LOADS of them coming from many different directions."
        ]
      }
    ],
    "link" : "https://xynodegaming.com/depths-of-malatar/"
  },
  {
    "dungeon" : "Direfrost Keep",
    "description" : "This dungeon you will have access to at level 24 or if you travel to the opening yourself at lower levels.",
    "image" : "https://imgur.com/Fvmbdae.png",
    "sets" : ["Magicka Furnace", "Ice furnace", "Draugr Hulk", "Iceheart"],
    "bosses" : [
      {"name" :  "Teethnasher The Frostbound",
        "mechanics": [
          "This boss is quite possibly the easiest boss in the dungeon. Of course most of the time the first one is the easiest to get you into the swing of things but the main thing to remember with this boss especially as the tank is to keep him STILL."
        ],
        "strategy" : [
          "**Charge** – The boss will do a charge attack in the direction of the tank or whoever has agro. This does NOT do a lot of damage and a simple block will be enough, just be sure to block it and you will be fine. Also he has a lot of light attacks which most tanks should be able to stand up to.",
          "**Ice wind** - The boss has a constant wind AoE surrounding it which ticks with ice damage every second. This also applies a snare affect. You should keep this boss very still and burn him down. You have two options. Stand in it and do your damage as a dps while the healer stays out of it and helps you all survive. OR do your damage, step out of it, recover and then go back in again. Either method works fine."
        ]
      },
      {"name" :  "Guardian Of The Flame",
        "mechanics": [
          "This boss is very simple IF the tank holds him still. The more you move the more difficult the fight gets. So find your positions and stay there unless the mechanics require you to move. Just get back into position after."
        ],
        "strategy" : [
          "**Heavy Attack** – Long swing into a heavy attack which MUST be blocked else you will be knocked down and across the floor. The tank should look out for this and always block it. If the boss is on a dps/healer, same rule applies, block it.",
          "**Charge** – Position is KEY! The furthest target will be charged by the boss and then hit with a nasty frontal AoE effect. He will randomly do this throughout the fight but generally it is due to people being too far away. If you are being charged you CAN block it. Running around will just get you killed.",
          "**Breath** – Boss will cast a breath attack on the person whoever has agro. This is a cone shaped effect and should be blocked. The tank wont take too much damage but anyone else can take quite a bit so if it is facing a dps/healer they should either dodge roll from it or simply block. Keep behind the boss at all times if you are a dps/healer.",
          "**Lightning splash** – The boss will occasionally aim at a random target and he will place an AoE on the ground under the feet of his target. Simply move out of the AoE and get back into a suitable position. Standing in the AoE WILL hurt a lot so don’t stay in it if you are not the tank."
        ]
      },
      {"name" :  "Drodda's Dreadlord",
        "mechanics": [
          "This boss is simple but can cause wipes if people are not paying attention. The tank should stay with the boss in the middle of the room and hold him still and watch for incoming banekins. The rest of the group should stay fairly close and watch for banekins."
        ],
        "strategy" : [
          "**Heavy attack** – This is a simple heavy attack. It is always aimed at the person who has agro. If it is on a dps/healer the same rules apply. BLOCK!",
          "**Cleave** – He will occasionally spin his weapon around his head emitting a small AoE around himself. This does damage over time and should be avoided by the squishies but the tank should be fine with it. Do NOT run away, just step out of it and you will be fine.",
          "**Exploding Banekins** – Periodically the boss will spawn exploding banekin adds, these do not have much health but be warned if they get CLOSE to a dps/healer they can almost oneshot a player. When these spawn the tank should try to chain/pin them as soon as possible to prevent them running at the group."
        ]
      },
      {"name" :  "Drodda's Apprentice",
        "mechanics": [
          "This boss is what will prepare you for the last boss. There are lots of adds to start with so be sure your tank grabs them as fast as possible on top of the boss while holding the boss still. Setup a formation surrounding the boss (everyone has their own space) around the back of the boss. Pay CLOSE attention to his mechanics and do NOT run away!"
        ],
        "strategy" : [
          "**Heavy Attack** – Occasionally the boss will heavy attack whoever has agro simple block this and you will be fine but if not you WILL be knocked down.",
          "**Ice blast** – Watch for the spreading AoE effect that comes from underneath the boss! When this mechanic starts happening, get out of the area, it will hit really hard and apply a knock down. This mechanic is VERY important to get used to for the last boss.",
          "**Drain** – The boss will pick a random target to attach a draining effect beam and the longer he holds the target in the air the more health he will gain back, you MUST break free from this.",
          "**Blast** – The boss periodically channels a cast timed ability which will launch a blast in aoe of affect at a random target. This can be interrupted so pay close attention to this and it wont ever be a problem. However if it is cast, just move out of the way before it lands."
        ]
      },
      {"name" :  "Iceheart",
        "mechanics": [
          "This boss is actually pretty simple and follows very similar rules to most standard Ice Atronahcs. The tank should position the boss and turn it away from the group. The group should always stay behind the boss and this will prevent them from taking damage from his most effective attacks."
        ],
        "strategy" : [
          "**Cone aoe** – This cone shaped affect AoE ability is always aimed in the direction of the person who has agro. Simply block this and you will take minimal damage, however if you are a dps/healer and this is aiming at you simply block or step out of it.",
          "**Ice blast** – Spreading AoE effect that comes from underneath the boss! When this mechanic starts happening, get out of the area it and once it is gone get back in again.",
          "**Slam** – The boss will smash the ground with his fist and a small AoE damage circle will appear under each player, after it bursts a large frost spike will come out of the ground and out of the spikes will spawn Draugr type enemies. They have very low health and are easy to kill quickly."
        ]
      },
      {"name" :  "Drodda Of Icereach",
        "mechanics": [
          "The boss has very simple mechanics but it can go so wrong so fast if people don’t pay attention. Key points for this fight are to make sure you do not run around, all find your own space and preserve your stamina, you WILL need it. This boss can be debuffed but NOT taunted, so the tank should keep up debuffs and grab adds. The tank is “protect mode” for this fight."
        ],
        "strategy" : [
          "**Light Attacks** – The boss will hit a random target, this is why everyone should have their own positions. She will fire off frost light attacks at her chosen target. These HURT! If you are the target, shield/block if (magicka) or block/dodge roll if (stamina). The healer should focus the target and keep them up, as 2 of these light attacks in a row without a heal WILL kill you.",
          "**Teleport and ice blast** – She will periodically teleport and spawn at a different location. The second she lands she will emit a very large AoE from under her and once it is at peak it will burst with ice shards from the ground. IF this hits a dps/healer, they are dead. One shot! Avoid this at all costs and THEN get back into position.",
          "**Ice Wraiths** – At 50% and under she will spawn ice wraiths (x2) every so often, these have light attacks and can use a charge ability which will knock down players, these are easy to spot and should be avoided or blocked. Tank should taunt these and stick them on the boss. AoE damage alone should be able to dispatch these fast.",
          "**Ice Atronachs** – Under 25% she will spawn 2x frost atronachs. They spawn spikes from the ground which should be avoided and they also attack with frontal cone attacks. The tank should treat these just like the wraiths and stack them on the boss so they can be killed with AoE. If they are on you and you are a dps/healer, just block. Let the tank grab control of them.",
          "**Drain!**– Periodically she will attach a beam to the target and every second will drain their health and heal herself. She heals by a lot. The KEY point to this mechanic is you MUST “BREAK FREE!”. If you do not have enough stamina to do so you are in trouble! When the beam is on you, break free instantly! This is why you must preserve your stamina throughout the fight."
        ]
      }
    ],
    "link" : "https://xynodegaming.com/direfrost/"
  },
  {
    "dungeon" : "Elden Hollow I",
    "description" : "This is one of the first dungeons you have access to at level 14 or if you travel to the opening yourself at lower levels. This is located at the center of the Grahtwood map.",
    "image" : "",
    "sets" : ["Light Speaker", "Barkskin", "Undaunted Bastion", "Chokethorn"],
    "bosses" : [
      {"name" :  "Akash Gra-mal",
        "mechanics": [
          "This boss is very simple as far as mechanics go. So long as the tank can block when required to, hold a taunt and keep the boss facing AWAY from the group, everything should be fine. Healers and dps should stand behind the boss at all times and stay close."
        ],
        "strategy" : [
          "**Cleave** – She will cleave in a frontal AOE in the shape of a cone, the tank should block this and hold her still making sure she does NOT face the group with this attack. It knocks back and can make things messy.",
          "**Whirlwind** – Occasionally the boss will spin her weapon around her head making a whirlwind AOE and anyone caught in this will take damage per tick. Simply stay out of the circle. The tank can stand in it if blocking, simply hold a taunt and keep her still. This ability is usually followed by a heavy attack/uppercut which can and SHOULD be blocked.",
          "**Jump** – IF someone gets too far from her she will randomly JUMP at players and land on their head. Do not run around, stay close to her and this mechanic will never happen. It is designed to keep up group co-ordination, and messy groups will have a problem with her."
        ]
      },
      {"name" :  "Ancient Spriggan",
        "mechanics": [
          "This boss is not really of any threat what so ever and is funny to be even considered as a boss due to its low damage and low health, however it is one none the less and of course we will go over it."
        ],
        "strategy" : [
          "**Minions** – As you enter the room you will notice that she will have 3 minions with her (smaller spriggans) these should be pulled together on top of the boss and turned away from the group. There are a few basic light attacks that they attempt to pull off and the odd heal which can be interrupted, however these can be killed VERY fast with even the lowest AOE damage.",
          "**HEAL** – She will occasionally try to heal her self or her minions and this is a channeled effect which is easily spotted by her raising her hands and can be interrupted to prevent her from doing so."
        ]
      },
      {"name" :  "Chokethorn",
        "mechanics": [
          "This boss has some of the simplest and obvious mechanics but can be SO messy in groups that do not focus on them. The tank should be taunting the boss at all times and turn the boss away from the group. The group should then circle fairly spread around the boss but CLOSE to it. The tank needs to make sure that blocks the heavy attacks which come occasionally during the fight."
        ],
        "strategy" : [
          "**Vine pull** – This Mechanic is very simple, IF you are too far away from the boss, it will chain you in and you are somewhat stuck for a second or so, this does minimal damage but is a pain and should be avoid if possible. This followed by the burst AOE mechanic can be a problem so do NOT run around the room.",
          "**Burst** – Chorkthorn will bury his head in the ground and a very large AOE will spread from the center of the room. This is your time to pay attention and get OUT of it. As soon as it is over, get back to your position. This is a very high damage ability. Simple mechanics, get out when it spreads.",
          "**Healing Stranglers** – Throughout the fight small stranglers will spawn around the room and attach a healing beam to the boss, healing for small amounts. These can be either interrupted or killed, but be sure to get back in position once you kill one to prevent the boss pulling you in with vines. Be sure to prioritize these targets."
        ]
      },
      {"name" :  "Nenesh Gro-mal",
        "mechanics": [
          "This boss is sometimes hard to see, he is in a LARGE group of enemies. The tank should look for the boss first and hold him on the spot facing away from the group. Then while holding the boss, try to pull in as many enemies as possible in order for the group to AOE damage the adds. DO NOT run around the room, let the tank control the targets before they get out of hand."
        ],
        "strategy" : [
          "**Heavy Attack** – A simple uppercut which should be blocked or else you will get knocked down. This is fine for even a dps to block as it does barely any damage.",
          "**Lightning Form** – Just like the sorcerer player ability, he is in the form of lightning and standing too close to him will zap players every second with shock damage, but the damage is VERY small. This shouldn’t cause much of a problem.",
          "**Burst/mages fury** – This is a channeled attack which bursts lightning once in a small AOE. It does minimal damage BUT it can be interrupted. So if the team is on point with interrupts, this mechanic will not be a problem at all."
        ]
      },
      {"name" :  "Leafseether",
        "mechanics": [
          "This boss is the big brother of the Alits in the dungeon. A big dinosaur looking boss with some very simple mechanics. He has one friend with him and the tank should taunt both the regular Alit and the boss and simply hold them together facing away from the group. The group should stay behind the boss at all times."
        ],
        "strategy" : [
          "**Bite** – An extremely weak attack which the tank can withstand without even blocking however can be problematic if too many hit a dps or healer, keep the boss turned away from the group.",
          "**Jump** – Just like the other enemies of this kind, he will JUMP in the air and slam onto the target he has agro too. It's basically a heavy attack and MUST be blocked. Be sure the tank is taunting and blocking during this mechanic to save any issues. IF the boss is loose on a dps or healer however they should BLOCK.",
          "**Breath and bite** – This is a breathe IN animation followed by a pretty nasty bite. This should be kept facing the tank, do NOT spin the boss around because it is a cone shaped AOE and can hit more than one person. This can be blocked but also, while it is casting you can actually just step out of it and then once it is over, step back in again."
        ]
      },
      {"name" :  "Canonreeve Oraneth",
        "mechanics": [
          "The final boss in this dungeon can be quite challenging. She can be taunted and held on the spot but a lot of mechanics will individually target other members of the group so co-ordination is key. __Tank__ should hold the boss in the center of the room and your __remaining group members__ should stand in a triangle formation having their OWN space. Do NOT run around the room. Find your spot and only move from it when you HAVE to."
        ],
        "strategy" : [
          "**Frost** – Very much like lightning form she will spawn a frost ability which will do very small damage over time to people very close to her, this is weak but indicates her next mechanic is coming.",
          "**Poison Bolt** – THIS mechanic is random and she will cast it on whoever she wants. She will physically turn and face the target she has chosen, wind up a channeled ability and fire a poison bolt at the player. If this is YOU, you NEED to dodge roll as she casts it. Doing so will mean you completely avoid the damage. This can kill most dps/healer types if they are not paying attention.",
          "**Stun** – This is a very easy to spot mechanic, she will place a rather small AOE on the ground on a player of her choice. Hands will come out of the ground and pull the player into the hole stunning them in place. The simple resolve to this mechanic is to not stand in it.",
          "**Skeletons** – Another small AOE similar to the one above but this one spawns 4x skeleton enemies. These should be killed quickly with AOE damage and the tank should try to grab them and put them with the boss (chains,range taunts). Keep co-ordinated and don’t panic. If they are on you, just block until the tank can grab them, or kill them fast, whichever works best for you. They do heavy attack though so look out for those.",
          "BLAST – This HUGE growing AOE is very simple. Get out of it or die. When you see it spreading, move backwards until you are out of it, and then when it is gone get back in again. A tank can withstand the damage if they are chunky enough but will get knocked back. A dps or healer will die in one shot. Pay attention and once it is gone, get back into your assigned position."
        ]
      }
    ],
    "link" : "https://xynodegaming.com/elden-hollow-1/"
  },
]
