[
  {
    "dungeon": "Arx Corinium",
    "description": "Arx Corinium is a dungeon filled with snakes and Lamia.",
    "image": "https://imgur.com/CwP9AxB.png",
    "sets": [
      "Sellistrix",
      "Lamia's Song",
      "Undaunted Infiltrator",
      "Medusa"
    ],
    "bosses": [
      {
        "name": "Fanged Menace",
        "mechanics": [
          "Frontal cone attack that causes knockback and damages severely any player caught in it.",
          "AOE Poison attack that absorbs health from those hit by it to the Boss. The red circle made underneat him while he curls up can damage heavily and also heal the boss.",
          "Other ads surrounding the boss",
          "Heavy melee attacks"
        ],
        "strategy": [
          "Deal with the ads first.",
          "The tank should block the heavy Melee attack and keep the boss focused away from the group.",
          "Avoid the large AOE red circle as it can instantly wipeout any player within its reach."
        ]
      },
      {
        "name": "Ganakton the Tempest",
        "mechanics": [
          "Lightning Wave that is emitted towards a random player. The wave can cause high amounts of Shock damage and stun anyone close-by.",
          "Immediately after the wave, the Boss will send a lightning bolt at the same player causing Shock damage and stunning them again.",
          "Ganakton can also electrify all players with a shock pulse every now and then. This does medium levels of damage but is unavoidable.",
          "Frontal cone lightning breath"
        ],
        "strategy": [
          "Due to all the shock waves that can stun players, it is best to spread out across the room to give yourself plenty of room to avoid the Waves and ensure you don't hurt another player in the process.",
          "If you get hit by the Wave, you can escape the Stun element by using an Interrupt or break free ability using your stamina.",
          "The shock pulses are difficult to avoid so it is best to just heal through them."
        ]
      },
      {
        "name": "Sliklenia the Songstress",
        "mechanics": [
          "A pet ad that you should not kill until the boss is dead.",
          "Sound pulse that does high amounts of damage when the boss sings.",
          "Heavy melee attack"
        ],
        "strategy": [
          "DON'T kill the pet before killing the boss. The ad is actually beneficial to the players in order to minimize the damage taken from the singing. When the boss sings, the pet will create a sonic shield in a random location in the room and retreat to it. You should follow the pet into that shield to avoid taking the crazy amounts of damage the Sound pulses can deal.(She must be a horrible singer because you can die from her singing!)",
          "Kill the pet after the Songstress dies.",
          "Tank should block the heavy melee attacks."
        ]
      },
      {
        "name": "Matron Ixniaa",
        "mechanics": [
          "Randomly places 2 circles (1 big and 1 small) underneath a player.",
          "Bunch of ads"
        ],
        "strategy": [
          "Deal with the ads first as they can be overwhelming if not taken care of from the start.",
          "The inner circle (smaller one) must be avoided as it can deal large amounts of damage and even kill you if you're not at full health. The outer circle (bigger one) does damage from which you can recover.",
          "Healer should try to keep the player targeted with the 2 circles at full health as a precaution"
        ]
      },
      {
        "name": "Ancient Lurcher",
        "mechanics": [
          "Randomly targets a player with a green beam that does severe poison damage.",
          "Red circles underneath the Boss that damage those caught inside.",
          "Enrage and Lightning charge that strengthens his AOE ability once his health is below 50%",
          "Bunch of ads"
        ],
        "strategy": [
          "Attack the ads first before you focus on the boss.",
          "Avoid the green beams as they can be fatal."
        ]
      },
      {
        "name": "Sellistrix the Lamia Queen",
        "mechanics": [
          "Charges at players at random doing small amounts of damage.",
          "Lightning strikes channelled at certain islands in the room marked by red circles. During this attack, if the Queen is in the water, the water becomes electrified and any players standing in the water will be electrocuted.",
          "Frontal cone scream that does heavy damage."
        ],
        "strategy": [
          "Tank should focus the Queen facing away from the rest of the group to ensure your group is not hit by the nasty frontal scream.",
          "Avoid being in the water as you risk being electrocuted if the lightning strike takes place while the Queen is standing in water.",
          "The islands are a safe bet but they get targeted by the lightning AOE from time to time.",
          "It may be better to just stay on the island and endure the AOE hit rather than stepping in the electrified water if you have a dedicated healer on your group.",
          "On land she gets a damage shield, the tank should get her in the water to do spell criticals and normal damage. When she electrocutes, get the tank out of the water.",
          "The screams are random and cannot be taunted.",
          "It appears that only the range taunts work, the piercing strike has trouble taunting her",
          "After scream, boss need to be taunt 5 time or boss attack random person"
        ]
      }
    ],
    "link": "https://elderscrollsonline.wiki.fextralife.com/Arx+Corinium"
  },
  {
    "dungeon": "Blackheart Haven",
    "description": "Blackheart Haven is pirate-infested dungeon that will keep the Tanks and Healers busy with the large amounts of damage and heavy attacks going about.",
    "image": "https://imgur.com/n4XWMWT.png",
    "sets": [
      "Pirate Skeleton",
      "Undaunted Unweaver",
      "Bone Pirate's Tatters",
      "Knight-Errant's Mail"
    ],
    "bosses": [
      {
        "name": "Iron-Heel",
        "mechanics": [
          "Heavy melee attacks that can knock you down if not blocked.",
          "AOE whirlwinds around himself that are easy to escape.",
          "Bunch of ads."
        ],
        "strategy": [
          "Kill the ads quickly. After that it is a straightforward fight."
        ]
      },
      {
        "name": "Atarus",
        "mechanics": [
          "Cone AOE that spews poisonous acid at the players.",
          "Stomp AOE knockdown (360 degrees).",
          "Charges towards the tank occasionally (indicated by red path).",
          "Heals himself back to 50% once after his health drops below 30%."
        ],
        "strategy": [
          "Avoid the AOE attacks by simply walking away.",
          "Move out of the path of the charge.",
          "Continue to attack after he regains his health back to 50%."
        ]
      },
      {
        "name": "First Mate Wavecutter",
        "mechanics": [
          "Harpies (ads) that deal ranged attacks which can damage you severely.",
          "Shadow Volley that deals severe magic damage to all players (up to 50% loss of health).",
          "Heavy attack that can knock you down if not blocked.",
          "AOE whirlwinds (360 degrees) around himself that are easy to escape."
        ],
        "strategy": [
          "There are 2 ways to handle this boss. The First is to ignore the ads and just go all out Rambo on the boss. The Second is to kill the ads one by one (however there is high risk of wiping out in the process this way)."
        ]
      },
      {
        "name": "Roost Mother",
        "mechanics": [
          "Fiery tornado targeting the Tank that can deal heavy damage.",
          "Rain of Fireballs that fall on expanding red circles on the ground. (Heavy damage).",
          "Frontal Cone AOE fire-breathing that can be difficult to avoid if you are standing in front of the Roost Mother.",
          "Random teleportation around the room."
        ],
        "strategy": [
          "The Fiery Tornado attack can be expected when the Roost Mother becomes surrounded by bats. The tank should step away from the boss when this happens to avoid being hit by this attack.",
          "Stay away from the red circles on the ground as fireballs will drop from the sky into those areas. You do not want to be hit by one of them.",
          "Keep moving around the room to deal damage to the boss (preferably from behind her so as to avoid the Frontal Cone AOE)."
        ]
      },
      {
        "name": "Hollow Heart",
        "mechanics": [
          "Ice projectiles that are fired in front of her and leave behind icy patches that slowly deal damage over time."
        ],
        "strategy": [
          "The boss is not difficult to handle. Tank should keep the boss focused away from the rest of the group to ensure the others are not hit by the Ice Projectiles."
        ]
      },
      {
        "name": "Captain Blackheart",
        "mechanics": [
          "6 Skeleton ads which includes archers.",
          "360 degree slash attack that is very quick but does little damage.",
          "boss charging to random group member and start converting him to skeleton (cannot be interrupted). Skeleton debuff lasts for 20-30 seconds."
        ],
        "strategy": [
          "Kill all the ads, prioritise the archers to avoid being overwhelmed."
        ]
      }
    ],
    "link": "https://elderscrollsonline.wiki.fextralife.com/Blackheart+Haven"
  },
  {
    "dungeon": "Blessed Crucible",
    "description": "Blessed Crucible is a dungeon that has a nordic feel to it.",
    "image": "https://imgur.com/HCnunA7.png",
    "sets": [
      "Troll King",
      "Sword Dancer",
      "Nikulas' Heavy Armor",
      "Noble Duelist's Silks"
    ],
    "bosses": [
      {
        "name": "Grunt the Clever",
        "mechanics": [
          "AOE Fear shout that periodically fears everyone.",
          "Massive frontal AOE melee attack."
        ],
        "strategy": [
          "Break free of the Fear using your Stamina.",
          "Avoid the frontal AOE by running away or rolling away if you must."
        ]
      },
      {
        "name": "The Pack",
        "mechanics": [
          "Consists of a number of bosses ( Fire mage, Dual Wielding Rogue, Heavy Armor Orc, Caster)",
          "Snagg Gro-Mashul (Armored Orc) does whirlwind AOE attacks with his two handed weapon.",
          "Nusana (Fire mage) casts beam of fire in front damaging everyone in its path.",
          "Dynus Aralas (Healer) who casts fire and ice spells",
          "Kayd at-Sal (Rogue) who should be tanked.",
          "Each boss turns into a werewolf at 30% health."
        ],
        "strategy": [
          "Go for the healer first as he can make the fight a pain.",
          "Then prioritise the Rogue as he can also be annoying with his quick attacks.",
          "After a certain time, health potions may appear in the middle of the room which can be used."
        ]
      },
      {
        "name": "Teranya the Faceless",
        "mechanics": [
          "360 degree AOE attack that does mild damage and can be easily avoided.",
          "Heavy melee attack that does heavy damage and knockdown if not blocked by the tank.",
          "Frigid Banekins that spawns at the Boss' original location and charge at players to explode and cause large AOE damage."
        ],
        "strategy": [
          "The boss itself is very simple. However the 2 Enraged Durzog ads that come with The Faceless can be very damaging and should be killed on priority."
        ]
      },
      {
        "name": "The Stinger & The Troll King",
        "mechanics": [
          "The Stinger periodically targets a player and then creates a poisonous cloud underneath them. This attack can be fatal if you don't move out of the cloud immediately.",
          "The Troll King can deal loads of damage with all his attacks. He will periodically jump towards a random target dealing damage to the entire group.",
          "The Troll also uses AOE attacks that can also cause heavy damage",
          "Frontal Tremor is an attack that the Troll uses to create waves around him that should be avoided."
        ],
        "strategy": [
          "Tank should keep the boss facing away from the group."
        ]
      },
      {
        "name": "Captain Thoran",
        "mechanics": [
          "Fire Runes that are cast on the ground causing moderate damage to those who step on them.",
          "Purple clouds that randomly appear around the room causing damage to anyone in them.",
          "At low health, a Lava Atronach is spawned, giving a big shield to the Captain. The shield disappears after killing the Atronach."
        ],
        "strategy": [
          "Kill the ads around before focusing on the boss.",
          "Keep moving around to avoid being caught in the purple clouds."
        ]
      },
      {
        "name": "Lava Queen",
        "mechanics": [
          "Periodically summons Lava Atronachs that shield the boss through their beams.",
          "Random lava eruptions marked by red circles.",
          "Large lava eruptions underneath the Queen when she swings her sword at the ground that can do damage in multiple directions.",
          "Fire attack on distant targets.",
          "Heavy melee attack."
        ],
        "strategy": [
          "Take it easy. Slow and steady wins the race. This fight is all about fighting the Lava Atronachs, avoiding the pools of lava being thrown at you and pulling back into the fight after the eruption stops.",
          "Heavy melle attacks should be blocked by the tank."
        ]
      }
    ],
    "link": "https://elderscrollsonline.wiki.fextralife.com/Blessed+Crucible"
  },
  {
    "dungeon": "Bloodroot Forge",
    "description": " This is a challenging dungeon in Veteran modes. Players should form a well-geared party at endgame level.",
    "image": "https://imgur.com/sxw9Vtn.png",
    "sets": [
      "Flame Blossom",
      "Blooddrinker",
      "Hagraven's Garden",
      "Earthgore"
    ],
    "bosses": [
      {
        "name": "Mathgamain",
        "mechanics": [
          "The boss will spawn little mini adds, try and taunt these best you can tank. If it means you turning around the boss towards the group, it’s not worth it. Try to range taunt and CC (crowd control) them. Chain pull works great as well.",
          "Stranglers will spawn randomly, they will put up AOEs everywhere which hurt a LOT! As soon as a Strangler appears, immediately focus on it! You can tell that a Strangler is present by the AOEs it puts out. As soon as you see an AOE, look for a Strangler and get it! Tank – No need to taunt these.",
          "The boss will get up on its hind legs and slam into the ground. Any group member hit by this will go down. Tank – you have to block or evade this, it’s very powerful."
        ],
        "strategy": [
          "The tank needs to make sure to pick up the adds as best as possible.",
          "Keep the boss faced away from the group – the cone AOE will one-shot squishy players.",
          "Kill stranglers first! Always kill stranglers first!",
          "Make sure to deal with the adds, don’t ignore them. CC if you can and get them before focusing on the boss."
        ]
      },
      {
        "name": "Caillaoife",
        "mechanics": [
          "The boss will put up a forest around her that will shield and deflect any attacks targeted at her. Don’t attack when she is in this state! You will always have adds when she is in forest mode so deal with those while she is in there.",
          "Make sure to keep an eye out for Stranglers ALL the time! As soon as you see one, deal with it immediately! Even if you have adds, Stranglers first! Always!",
          "When she is in forest mode, the tank will lose aggro, there is no way to taunt her. So she will start dispatching these ice balls at random players. Make sure to stay on your guard during the forest phase when dealing with adds. The ice balls will come out of nowhere and one-shot you!",
          "Adds will show up whenever the boss enters forest shield mode. The tank should CC, taunt these and clump them up. Damage dealers – give it your best with AOEs, focus should be on the bigger add."
        ],
        "strategy": [
          "Stranglers first! Always deal with stranglers as soon as you spot them no matter what else is going on.",
          "Watch out for the boss’ iceball attacks that trace the ground – they will one-shot you.",
          "The boss will surround herself with a forest and adds will spawn – deal with the adds first!",
          "Don’t attack the boss when she has the forest around her, it will reflect your attack back onto you!",
          "Face the boss away from the group! She does cone attacks and nasty ice balls."
        ]
      },
      {
        "name": "Stoneheart",
        "mechanics": [
          "The boss will animate Stone Atronachs, you can see this by watching the boss, he will wave his hand and emit red magic. The red magic will flow to the Atronach about to be animated.",
          "The boss will keep putting out fire AOEs at his target’s feet. Tank, you can back away when this happens so that the AOEs don’t end up near the boss. Range taunt him to keep aggro.",
          "The boss will root all players and immediately start shooting out little fireballs in all directions that will trace the ground. These hurt quite a lot so back off and do your best at avoiding these!",
          "When the boss reaches 20% he will animate ALL Stone Atronachs. This is a DPS (damage per second) race, it’s time to ignore all the Stone Atronachs and max out your damage on the boss."
        ],
        "strategy": [
          "The boss will animate Stone Atronachs – these are the number one priority for damage dealers.",
          "At 20% the boss will animate all Stone Atronachs, this is an execute phase, ignore all Atronachs and burn the boss down with Ultimates.",
          "The boss’ fire AOEs are bad for squishy players, stay away from them as much as you can!"
        ]
      },
      {
        "name": "Galchobhar",
        "mechanics": [
          "The boss will slam his mace into the ground and open up a hole in the ground. This hole will emit fireballs that will fly onto all players. This deals a ton of damage and will wipe the group!",
          "The boss will slam into the ground and kill anyone standing on the island. The only way to avoid this is to jump onto one of the small rocks that surround the island.",
          "After he is done, on veteran difficulty there will be a firewall for a few seconds around the island, make sure you wait for this to go away before jumping back on the main island! It will take you out instantly.",
          "There will be shalks spawning throughout the fight. Focus them down as soon as they appear, and jump onto a rock if you get targeted by their homing fireball. Wait for the fireball to merge with the lava, then you are safe to jump back onto the main island."
        ],
        "strategy": [
          "The tank has to “plug” the lava geyser to avoid a group wipe, more on this below.",
          "During the big AOE that covers the entire island, jump onto a rock, no sharing!",
          "Face the boss away from the group, he shoots out fireballs in the direction he is facing."
        ]
      },
      {
        "name": "Earthgore Amalgam",
        "mechanics": [
          "At each end of the room, you will find two altars. These will need to be used through this fight and one person should be appointed to each altar. Generally, the damage dealers will be responsible for these.",
          "The Blood Altar will create a rain of blood wherever you aim at the point of synergizing. This can be used to remove the flowing lava that the boss sends out.",
          "The Fire Altar will hurl a fireball at your target upon synergizing with the altar. This will stun the boss. Use the fire altar when the boss is slamming the ground and rocks are falling from the sky.",
          "The boss will spawn a smaller version of itself. This will happen twice so you will have a total of 3 bosses to deal with. The boss will split at 70% – 40%  health percentages.",
          "To activate hard mode in Bloodroot Forge you need to read the Scroll of Glorious Battle located by the chest that appears after beating the Bullblood Trio. The main difference is that now you are not allowed to use the Altars."
        ],
        "strategy": [
          "**Tank:** Once you have 3 copies of the boss hammering you, you HAVE to pay attention to incoming heavy attacks! If you miss one block, you are down! Do NOT lose aggro on any of them at any point!  Maintaining resources in this last stage will be very difficult. Make sure you have potions ready for the third copy of the boss, ultimate, everything you’ve got!",
          "**Healer:** the tank will need every resource help possible, feed shards and bubbles!",
          "**Damage:** The boss will split itself into 3 versions of himself, you should always focus on the smallest copy!",
          "Manage the lava with the Blood Altar.",
          "Manage the falling rocks with the Fire Altar."
        ]
      }
    ],
    "link": "https://esoplanet.com/bloodroot-forge-dungeon-guide/"
  },
  {
    "dungeon": "City of Ash I",
    "description": "City of Ash is another 4-man dungeon in Elder Scrolls Online. It is found in Greenshade.",
    "image": "https://imgur.com/pV5HmZ8.png",
    "sets": [
      "Infernal Guardian",
      "Burning Spellweave",
      "Sunderflame",
      "Embershield"
    ],
    "bosses": [
      {
        "name": "Infernal Guardian",
        "mechanics": [
          "**Double Slam** - This is a pretty simple melee attack that should only hit the person with agro and can be blocked, it shouldn’t cause much of a problem.",
          "**Thorny Backhand** – This is a backhand animation and adds a bleed to the target so this should hopefully ONLY be hitting the tank meaning others don’t receive this damage.",
          "**Fiery Explosion** – The boss will shake violently throwing fireballs all around landing on the ground making aoe splash effects, you need to avoid these as dps/healer as much as possible. one or two hits can kill anything that is not a tank so watch your feet. Also during this phase he does close aoe fire damage from his location so stand back a bit.",
          "**Tunneling Roots** – When he stomps the ground he will make roots stream across the floor and whoever is caught in this will be immobilized on the spot (rooted) simple avoid this by moving left or right when you see it coming, OR dodge roll out of it if you get caught. it does a decent amount of physical damage so be careful not to get caught out if you are not the tank."
        ],
        "strategy": [
          "The tank should basically hold it still, as central to the room as possible and facing away from the group. He can however still hurt the group with various affects which if not paid attention to can one shot a squishy and/or wipe a group. So watch your feet!"
        ]
      },
      {
        "name": "Golor The Banekin Handler",
        "mechanics": [
          "This boss is extremely easy to kill however has some high damage if not controlled. Make sure your tank holds him STILL, do NOT run around the room and keep the banekins controlled if your group doesn’t have much damage."
        ],
        "strategy": [
          "**Crushing Blow** – Apart from his basic light attacks, the boss occasionally he will fire off a heavy attack, if you do not block this you will be knocked down and if the baneklins are still alive you can get overwhelmed with damage so make sure you BLOCK this.",
          "**Cleave** – he will spin her sword around her head, anyone caught in it will take physical damage over time. This is very obvious and easy to see, simply stay out of it and you will be fine.",
          "**Summon Banekin/daedra** – Throughout the fight he will summon 3 banekins (he starts with 3 also when you initiate the fight). Get your tank to pull them together and hold them in place while the dps do aoe damage to gradually kill them."
        ]
      },
      {
        "name": "Warden of the Shrine",
        "mechanics": [
          "**Heavy Attack** – The boss occasionally will fire off a nasty dual wield heavy attack with a MASSIVE knock back. You as the tank MUST block this or the fight is going to get messy fast! If a dps or healer has it they MUST also block it or they will most likely die, but above all your tank needs to be sure that this attack is ON the tank and not the squishies.",
          "**Blazing Fire** – The boss will spin and put a ring of small fire AoEs around him on the ground. Sometimes it will be clustered up, in which case stay away from it. Other times it can have a gap in the middle which you can stand in and take no damage. Keep an eye on which one it is and position yourself accordingly. Do NOT stand in the fire.",
          "**Teleport strike** – IF someone decides to run away from the boss, he WILL punish you. Stay close don’t panic and pay attention to his mechanics. IF you are the furthest away, he will strike you in the back. If you see this coming, you must block."
        ],
        "strategy": [
          "You are in a confined space on top of a cliff of sorts and one false move will wipe your group. **Tank** should try to keep him on his starting platform as much as possible and turn him AWAY from the group. Do not run around the place you do not have room."
        ]
      },
      {
        "name": "Dark Ember",
        "mechanics": [
          "**Lava Geyser** – This is an extremely easy to spot mechanic. Small spreading AoEs on the ground which erupt like a geyser of lava! The tank can with stand this if blocking but this is primarily cast on people that do NOT have agro. This is a very simple mechanic to avoid and all you need to do is simply, step out of it, wait for it to blow up, and then get back in position again.",
          "**Combustion** – When she dies she emits a Small AoE around her body and then it will explode. This will one shot a dps or healer."
        ],
        "strategy": [
          "She spawns with a few adds once the gate is clear and the tank should grab these right away, stack them on top of her and turn her away from the group. Her basic fireball attacks can be blocked and should only hit whoever has agro."
        ]
      },
      {
        "name": "Rothariel Flameheart",
        "mechanics": [
          "**Heavy attack** – She has a heavy attack that will knock you flying and do a nasty amount of damage especially if she follows up with a light attack afterwards. This will ONLY hit the person who has agro.",
          "**Berserker Frenzy** – She will spin her sword around her head, anyone caught in it will take physical damage over time. This is very obvious and easy to see, simply stay out of it and you will be fine.",
          "**Burning Field** – She will summon pools of fire on the ground which you must stay out of, these are VERY easy to see as they are big burst of fire on the ground. The damage isn’t too high but you don’t want to be in there for long.",
          "**Summon Clones** – Straight after the above mechanic she will spawn 3 clones of her self. They take MASSIVE damage in comparison to her so this is how you spot which one is which. They deal the same damage as the boss so should be killed fast."
        ],
        "strategy": [
          "This boss is fairly fast due to her low health but things can go horribly wrong if not controlled especially during her clone phase. Your tank should position her in the center and the dps should focus her down while preparing for each phase. The area you fight in is small and if you run down the stairs she will reset."
        ]
      },
      {
        "name": "Razor Master Erthas",
        "mechanics": [
          "**Fire burst** – Occasionally the boss will fire a projectile in the air and when it lands it will burst causing a 4 way cross affect of fire trailing along the floor. This won’t one shot you but this will do a LOT of damage so avoid it as much as possible.",
          "**Minions** – Whenever he says “rise minion” he will summon a flame atronach. These deal nasty flame attacks from range and explode when they die. Your tank should range taunt these to keep the damage off the group while the dps try to dispatch them quickly. Not killing them will result in having way too many of them towards the end of the fight.",
          "**Teleport** – Throughout the fight Razor will teleport to a random location. You can simply run to where he is and continue as your were while he repeats his rotation. THIS is your opportunity to throw down ultimates. save ultimates until he moves and drop them on him when he gets there. The reason for this is if you throw them down mid rotation he COULD teleport out of it and you loose overall dps.",
          "**Flame Shot** – Your group should be standing in somewhat of a formation. This is because periodically he will aim at a chosen member of the group and fire a heavy attack type shot at them. The ability can be blocked and/or dodged BUT if it physically hits you the dot will still stay with you. The fire dot is of a LONG duration. To clear this effect jump in the water.",
          "**Enrage** – The final phase under 25% he instead of spawning 1 atronach, will in fact spawn 3! Get your tank on point with the taunts and kill all of the atronachs before focusing the boss."
        ],
        "strategy": [
          "This boss is a ranged attacker but there is Lots of fire and there are LOTS of additional minions, so your tank will need a close ranged and long ranged taunt for this. Hold the boss as still as possible."
        ]
      }
    ],
    "link": "https://xynodegaming.com/cityofash1/"
  },
  {
  "dungeon" : "City of Ash II",
  "description" : "Veteran City of Ash presents some very challenging but fun boss fights for Veterans. The City of Ash is engulfed in flames, loads of them!",
    "image": "https://imgur.com/oN9jHpw.png",
  "sets" : ["Valkyn Skoria", "Burning Spellweave", "Sunderflame", "Embershield"],
  "bosses" : [
    {"name" :  "Xivilai Rukhan",
      "mechanics": [
        "This boss is assisted by two ranged Dremora friends, a Mage and an Archer.",
        "The boss typically deals a heavy attack which can be blocked.",
        "Upon the death of his companions, the boss will spawn series of Flame Atronachs who typically can be ignored."
      ],
      "strategy" : [
        "Deal with the two ranged assistants first as quickly as possible because the Mage and the Archer can randomly teleport in front of or behind you.",
        "**Tank** should keep the boss facing away from the rest of the group, and deal some AOE when possible.",
        "**Healer** should position himself between the tank and DPS to provide constant healing to low healthed allies or employ 'healing over time' effects at the earliest instance possible.",
        "Fight the boss from atleast an 8 meter range if possible to avoid the damaging red circles."
      ]
    },
    {"name" :  "Urata the Legion",
      "mechanics": [
        "Urata spawns 20 additional mobs which have to be cleared in order to fight him.",
        "She constantly spawns red circles on players to penalize those who stay still too long."
      ],
      "strategy" : [
        "Attack the ads first and use them to attain ultimates faster. Avoid the red circles and continually attack at the same time.",
        "**Tank** should use taunts from range and stun the ads as much as possible.",
        "**Healer** should have an easier job of just keeping an eye on players getting damaged from the red circles."
      ]
    },
    {"name" :  "Xivilai Boltaic & Xivilai Fulminator",
      "mechanics": [
        "These two bosses are very alike and simple to strike down."
      ],
      "strategy" : [
        "Just nuke the two of them and move on."
      ]
    },
    {"name" :  "Horvantud the Fire Maw",
      "mechanics": [
        "This boss often spews hot lava that shall vaporize players if not agro'd away from the team.",
        "He starts with earthquakes that cause rocks to spring out of the floor, which if not blocked can deal a lot of damage.",
        "Boss also stomps to cause red circles which are best avoided by spreading out."
      ],
      "strategy" : [
        "**Tank** face the boss away from the group and roll out of the cleave attacks.",
        "Stay spread out from each other during the stomping and watch the ground for the red circles. Step out of them but stay near, as you will immediately have to go back to them to protect yourself from the damage.",
        "Use ultimates when possible to deal as much damage to ads and the boss."
      ]
    },
    {"name" :  "Ash Titan",
      "mechanics": [
        "The aggro will cause the boss to throw fire circles at your feet.",
        "The boss will also occasionally jump to cause waves of fire to push you back.",
        "There will be ads but they deal very little damage."
      ],
      "strategy" : [
        "**Tank** should taunt the ads but keep the boss agro'd as much as possible. ",
        " Avoid the big red circles and heal through smaller ones. Always be ready to roll to avoid double red circles spawning at your feet.",
        "**Healer** must keep the tank alive to avoid losing to the boss.",
        "**Damage dealers** should just charge in and attack as much as possible while avoiding the waves and big red circles."
      ]
    },
    {"name" :  "Valkyn Skoria",
      "mechanics": [
        "This fight is very tough if you don’t have the dps for it, because it has something which we used to call “Enrage Timer”. Meaning that there’s only so much time that you have to kill it before it becomes impossible and you all die."
      ],
      "strategy" : [
        " You will have 5 platforms available, which will be destroyed by the Dremora general after some time and Valkyn Skoria teleports to the next platform. Just run to the next platform as soon as possible and remember to stay together!",
        "**Flame Strike** - An exploding fire that emanates into various directions. It can be entirely avoided. The more you are on the move, the less damage you get and you shouldn’t get hit too often.",
        "**Tank** should definitely keep an eye out for his Heavy Attack, otherwise might lose control of him and/or be pushed into the lava.",
        "After having destroyed a platform and having teleported to a new one, Valkyn Skoria lifts his sword up high and shoot fire balls from it. Additionally, he will gain a damage shield and you need to destroy this before he stops doing his attack.",
        "Aimed at a random group member, the boss will imprison someone into a stone prison from which you have to break free. You can dodge roll it, but only if you notice it in time.",
        "During the fight the Boss can charge a Flame Bolt at a random group member, meaning you will be tossed backwards into the lava if you don’t block or dodge roll this attack.",
        "Upon destroying the platform and teleporting to a new one, as soon as he raises his shield and sword, Flame Atronachs will spawn. Best is to take them to the center and kill them in the DDs’ AoE, as they will die relatively quickly.",
        "**Hardmode** differs from the normal mode pretty much in having 2 platforms removed, which in turns means that you have less time to beat Valkyn Skoria. Only do this if you bring a lot of dps to the table, because otherwise this might be an impossible task. You can active the Hardmode in the far right and upper corner. On an altar you can find the scroll."
      ]
    }
  ],
  "link" : "https://alcasthq.com/eso-city-of-ash-2-dungeon-guide/"
}
]
